[
    {
        "title": "RICK",
        "content": "I am wired to constantly ask “what’s next?” Sometimes, the answer is: “more of the same.”\nThat came to mind when a friend raised a point about emerging technology’s fractal nature. Across one story arc, they said, we often see several structural evolutions—smaller-scale versions of that wider phenomenon.\nCloud computing? It progressed from “raw compute and storage” to “reimplementing key services in push-button fashion” to “becoming the backbone of AI work”—all under the umbrella of “renting time and storage on someone else’s computers.” Web3 has similarly progressed through “basic blockchain and cryptocurrency tokens” to “decentralized finance” to “NFTs as loyalty cards.” Each step has been a twist on “what if we could write code to interact with a tamper-resistant ledger in real-time?”\nMost recently, I’ve been thinking about this in terms of the space we currently call “AI.” I’ve called out the data field’s rebranding efforts before; but even then, I acknowledged that these weren’t just new coats of paint. Each time, the underlying implementation changed a bit while still staying true to the larger phenomenon of “Analyzing Data for Fun and Profit.”\nConsider the structural evolutions of that theme:\nStage 1: Hadoop and Big Data \nBy 2008, many companies found themselves at the intersection of “a steep increase in online activity” and “a sharp decline in costs for storage and computing.” They weren’t quite sure what this “data” substance was, but they’d convinced themselves that they had tons of it that they could monetize. All they needed was a tool that could handle the massive workload. And Hadoop rolled in.\nIn short order, it was tough to get a data job if you didn’t have some Hadoop behind your name. And harder to sell a data-related product unless it spoke to Hadoop. The elephant was unstoppable.\nUntil it wasn’t. \nHadoop’s value—being able to crunch large datasets—often paled in comparison to its costs. A basic, production-ready cluster priced out to the low-six-figures. A company then needed to train up their ops team to manage the cluster, and their analysts to express their ideas in MapReduce. Plus there was all of the infrastructure to push data into the cluster in the first place. \nIf you weren’t in the terabytes-a-day club, you really had to take a step back and ask what this was all for. Doubly so as hardware improved, eating away at the lower end of Hadoop-worthy work.\nAnd then there was the other problem: for all the fanfare, Hadoop was really large-scale business intelligence (BI).\n(Enough time has passed; I think we can now be honest with ourselves. We built an entire industry by … repackaging an existing industry. This is the power of marketing.)\nDon’t get me wrong. BI is useful. I’ve sung its praises time and again. But the grouping and summarizing just wasn’t exciting enough for the data addicts. They’d grown tired of learning what is; now they wanted to know what’s next.\nStage 2: Machine learning models\nHadoop could kind of do ML, thanks to third-party tools. But in its early form of a Hadoop-based ML library, Mahout still required data scientists to write in Java. And it (wisely) stuck to implementations of industry-standard algorithms. If you wanted ML beyond what Mahout provided, you had to frame your problem in MapReduce terms. Mental contortions led to code contortions led to frustration. And, often, to giving up.\n(After coauthoring Parallel R I gave a number of talks on using Hadoop. A common audience question was “can Hadoop run [my arbitrary analysis job or home-grown algorithm]?” And my answer was a qualified yes: “Hadoop could theoretically scale your job. But only if you or someone else will take the time to implement that approach in MapReduce.” That didn’t go over well.)\nGoodbye, Hadoop. Hello, R and scikit-learn. A typical data job interview now skipped MapReduce in favor of white-boarding k-means clustering or random forests.\nAnd it was good. For a few years, even. But then we hit another hurdle.\nWhile data scientists were no longer handling Hadoop-sized workloads, they were trying to build predictive models on a different kind of “large” dataset: so-called “unstructured data.” (I prefer to call that “soft numbers,” but that’s another story.) A single document may represent thousands of features. An image? Millions.\nSimilar to the dawn of Hadoop, we were back to problems that existing tools could not solve.\nThe solution led us to the next structural evolution. And that brings our story to the present day:\nStage 3: Neural networks\nHigh-end video games required high-end video cards. And since the cards couldn’t tell the difference between “matrix algebra for on-screen display” and “matrix algebra for machine learning,” neural networks became computationally feasible and commercially viable. It felt like, almost overnight, all of machine learning took on some kind of neural backend. Those algorithms packaged with scikit-learn? They were unceremoniously relabeled “classical machine learning.”\nThere’s as much Keras, TensorFlow, and Torch today as there was Hadoop back in 2010-2012. The data scientist—sorry, “machine learning engineer” or “AI specialist”—job interview now involves one of those toolkits, or one of the higher-level abstractions such as HuggingFace Transformers.\nAnd just as we started to complain that the crypto miners were snapping up all of the affordable GPU cards, cloud providers stepped up to offer access on-demand. Between Google (Vertex AI and Colab) and Amazon (SageMaker), you can now get all of the GPU power your credit card can handle. Google goes a step further in offering compute instances with its specialized TPU hardware.\nNot that you’ll even need GPU access all that often. A number of groups, from small research teams to tech behemoths, have used their own GPUs to train on large, interesting datasets and they give those models away for free on sites like TensorFlow Hub and Hugging Face Hub. You can download these models to use out of the box, or employ minimal compute resources to fine-tune them for your particular task.\nYou see the extreme version of this pretrained model phenomenon in the large language models (LLMs) that drive tools like Midjourney or ChatGPT. The overall idea of generative AI is to get a model to create content that could have reasonably fit into its training data. For a sufficiently large training dataset—say, “billions of online images” or “the entirety of Wikipedia”—a model can pick up on the kinds of patterns that make its outputs seem eerily lifelike.\nSince we’re covered as far as compute power, tools, and even prebuilt models, what are the frictions of GPU-enabled ML? What will drive us to the next structural iteration of Analyzing Data for Fun and Profit?\nStage 4? Simulation\nGiven the progression thus far, I think the next structural evolution of Analyzing Data for Fun and Profit will involve a new appreciation for randomness. Specifically, through simulation.\nYou can see a simulation as a temporary, synthetic environment in which to test an idea. We do this all the time, when we ask “what if?” and play it out in our minds. “What if we leave an hour earlier?” (We’ll miss rush hour traffic.) “What if I bring my duffel bag instead of the roll-aboard?” (It will be easier to fit in the overhead storage.) That works just fine when there are only a few possible outcomes, across a small set of parameters.\nOnce we’re able to quantify a situation, we can let a computer run “what if?” scenarios at industrial scale. Millions of tests, across as many parameters as will fit on the hardware. It’ll even summarize the results if we ask nicely. That opens the door to a number of possibilities, three of which I’ll highlight here:\nMoving beyond from point estimates\nLet’s say an ML model tells us that this house should sell for $744,568.92. Great! We’ve gotten a machine to make a prediction for us. What more could we possibly want?\nContext, for one. The model’s output is just a single number, a point estimate of the most likely price. What we really want is the spread—the range of likely values for that price. Does the model think the correct price falls between $743k-$746k? Or is it more like $600k-$900k? You want the former case if you’re trying to buy or sell that property.\nBayesian data analysis, and other techniques that rely on simulation behind the scenes, offer additional insight here. These approaches vary some parameters, run the process a few million times, and give us a nice curve that shows how often the answer is (or, “is not”) close to that $744k.\nSimilarly, Monte Carlo simulations can help us spot trends and outliers in potential outcomes of a process. “Here’s our risk model. Let’s assume these ten parameters can vary, then try the model with several million variations on those parameter sets. What can we learn about the potential outcomes?” Such a simulation could reveal that, under certain specific circumstances, we get a case of total ruin. Isn’t it nice to uncover that in a simulated environment, where we can map out our risk mitigation strategies with calm, level heads?\nMoving beyond point estimates is very close to present-day AI challenges. That’s why it’s a likely next step in Analyzing Data for Fun and Profit. In turn, that could open the door to other techniques:\nNew ways of exploring the solution space\nIf you’re not familiar with evolutionary algorithms, they’re a twist on the traditional Monte Carlo approach. In fact, they’re like several small Monte Carlo simulations run in sequence. After each iteration, the process compares the results to its fitness function, then mixes the attributes of the top performers. Hence the term “evolutionary”—combining the winners is akin to parents passing a mix of their attributes on to progeny. Repeat this enough times and you may just find the best set of parameters for your problem.\n(People familiar with optimization algorithms will recognize this as a twist on simulated annealing: start with random parameters and attributes, and narrow that scope over time.)\nA number of scholars have tested this shuffle-and-recombine-till-we-find-a-winner approach on timetable scheduling. Their research has applied evolutionary algorithms to groups that need efficient ways to manage finite, time-based resources such as classrooms and factory equipment. Other groups have tested evolutionary algorithms in drug discovery. Both situations benefit from a technique that optimizes the search through a large and daunting solution space.\nThe NASA ST5 antenna is another example. Its bent, twisted wire stands in stark contrast to the straight aerials with which we are familiar. There’s no chance that a human would ever have come up with it. But the evolutionary approach could, in part because it was not limited by human sense of aesthetic or any preconceived notions of what an “antenna” could be. It just kept shuffling the designs that satisfied its fitness function until the process finally converged.\nTaming complexity\nComplex adaptive systems are hardly a new concept, though most people got a harsh introduction at the start of the Covid-19 pandemic. Cities closed down, supply chains snarled, and people—independent actors, behaving in their own best interests—made it worse by hoarding supplies because they thought distribution and manufacturing would never recover. Today, reports of idle cargo ships and overloaded seaside ports remind us that we shifted from under- to over-supply. The mess is far from over.\nWhat makes a complex system troublesome isn’t the sheer number of connections. It’s not even that many of those connections are invisible because a person can’t see the entire system at once. The problem is that those hidden connections only become visible during a malfunction: a failure in Component B affects not only neighboring Components A and C, but also triggers disruptions in T and R. R’s issue is small on its own, but it has just led to an outsized impact in Φ and Σ. \n(And if you just asked “wait, how did Greek letters get mixed up in this?” then …  you get the point.)\nOur current crop of AI tools is powerful, yet ill-equipped to provide insight into complex systems. We can’t surface these hidden connections using a collection of independently-derived point estimates; we need something that can simulate the entangled system of independent actors moving all at once.\nThis is where agent-based modeling (ABM) comes into play. This technique simulates interactions in a complex system. Similar to the way a Monte Carlo simulation can surface outliers, an ABM can catch unexpected or unfavorable interactions in a safe, synthetic environment.\nFinancial markets and other economic situations are prime candidates for ABM. These are spaces where a large number of actors behave according to their rational self-interest, and their actions feed into the system and affect others’ behavior. According to practitioners of complexity economics (a study that owes its origins to the Sante Fe Institute), traditional economic modeling treats these systems as though they run in an equilibrium state and therefore fails to identify certain kinds of disruptions. ABM captures a more realistic picture because it simulates a system that feeds back into itself.\nSmoothing the on-ramp\nInterestingly enough, I haven’t mentioned anything new or ground-breaking. Bayesian data analysis and Monte Carlo simulations are common in finance and insurance. I was first introduced to evolutionary algorithms and agent-based modeling more than fifteen years ago. (If memory serves, this was shortly before I shifted my career to what we now call AI.) And even then I was late to the party.\nSo why hasn’t this next phase of Analyzing Data for Fun and Profit taken off?\nFor one, this structural evolution needs a name. Something to distinguish it from “AI.” Something to market. I’ve been using the term “synthetics,” so I’ll offer that up. (Bonus: this umbrella term neatly includes generative AI’s ability to create text, images, and other realistic-yet-heretofore-unseen data points. So we can ride that wave of publicity.)\nNext up is compute power. Simulations are CPU-heavy, and sometimes memory-bound. Cloud computing providers make that easier to handle, though, so long as you don’t mind the credit card bill. Eventually we’ll get simulation-specific hardware—what will be the GPU or TPU of simulation?—but I think synthetics can gain traction on existing gear.\nThe third and largest hurdle is the lack of simulation-specific frameworks. As we surface more use cases—as we apply these techniques to real business problems or even academic challenges—we’ll improve the tools because we’ll want to make that work easier. As the tools improve, that reduces the costs of trying the techniques on other use cases. This kicks off another iteration of the value loop. Use cases tend to magically appear as techniques get easier to use.\nIf you think I’m overstating the power of tools to spread an idea, imagine trying to solve a problem with a new toolset while also creating that toolset at the same time. It’s tough to balance those competing concerns. If someone else offers to build the tool while you use it and road-test it, you’re probably going to accept. This is why these days we use TensorFlow or Torch instead of hand-writing our backpropagation loops.\nToday’s landscape of simulation tooling is uneven. People doing Bayesian data analysis have their choice of two robust, authoritative offerings in Stan and PyMC3, plus a variety of books to understand the mechanics of the process. Things fall off after that. Most of the Monte Carlo simulations I’ve seen are of the hand-rolled variety. And a quick survey of agent-based modeling and evolutionary algorithms turns up a mix of proprietary apps and nascent open-source projects, some of which are geared for a particular problem domain.\nAs we develop the authoritative toolkits for simulations—the TensorFlow of agent-based modeling and the Hadoop of evolutionary algorithms, if you will—expect adoption to grow. Doubly so, as commercial entities build services around those toolkits and rev up their own marketing (and publishing, and certification) machines. \nTime will tell \nMy expectations of what to come are, admittedly, shaped by my experience and clouded by my interests. Time will tell whether any of this hits the mark.\nA change in business or consumer appetite could also send the field down a different road. The next hot device, app, or service will get an outsized vote in what companies and consumers expect of technology.\nStill, I see value in looking for this field’s structural evolutions. The wider story arc changes with each iteration to address changes in appetite. Practitioners and entrepreneurs, take note.\nJob-seekers should do the same. Remember that you once needed Hadoop on your résumé to merit a second look; nowadays it’s a liability. Building models is a desired skill for now, but it’s slowly giving way to robots. So do you really think it’s too late to join the data field? I think not.\nKeep an eye out for that next wave. That’ll be your time to jump in.",
        "link": "https://www.oreilly.com/radar/structural-evolutions-in-data/"
    },
    {
        "emp_name": "Nikhil",
        "email": "nikhil@geeksforgeeks.org",
        "job_profile": "Full Time"
    },
    {
        "title": "Nikhil",
        "content": "nikhil@geeksforgeeks.org",
        "link": "Full Time"
    },
    {
        "title": "SYSTEM — ‘HEY RICK, THE ONE THING I’VE ALWAYS WANTED TO ASK YOU IS...’ — SPRING SUMMER 2022 ISSUE 19",
        "content": "SYSTEM — ‘HEY RICK, THE ONE THING I’VE ALWAYS WANTED TO ASK YOU IS...’ — SPRING SUMMER 2022 ISSUE 19 \n\n\n\n I’M CURRENTLY READING A JOSEPH BEUYS BIOGRAPHY, WHICH IS VERY SOOTHING. I FEEL THAT HIS WAS A SELF-CONTAINED WORLD THAT I WOULD KIND OF ASPIRE TO. I KNOW THAT A LOT OF THAT IS MY OWN PROJECTION, MY FANTASY AND MY INTERPRETATION OF WHO JOSEPH BEUYS WAS, BUT I ALLOW MYSELF TO ROMANTICISE IT BECAUSE THAT MAKES IT MORE FUN. I SUSPECT THAT PEOPLE DO KIND OF THE SAME WITH ME. THEY ARE ROMANTICIZING ME TO FIT THEIR NEEDS, AND THAT’S FINE. I AM HAPPY TO BE SOME KIND OF SYMBOL THAT THEY CAN ELABORATE ON. \n\n\n\n CONVERSELY, I SEE MYSELF IN THEM, BECAUSE WE ARE ALL ALIKE. THE THINGS I TALK ABOUT IN EVERY SHOW ARE PRIMAL, UNIVERSAL CONCERNS ABOUT EMPATHY, INCLUSION, EXCLUSION, SHAME, PRIDE, SELF-LOATHING, AGGRESSION, AND THE NEED FOR ACCEPTANCE. BY EXAMINING THESE THINGS AND BY DEMYSTIFYING THEM, AND BY ME REASSURING OTHER PEOPLE THAT WE HAVE ALL FELT AND EXPERIENCED THEM – THAT IS WHAT I THINK PEOPLE HAVE RESPONDED TO. \n\n\n\n LISTENING TO THESE PEOPLE’S STORIES, SEEING THEM LOOKING SO GREAT IN THE LOOKS WE’VE DESIGNED, AND ANSWERING THEIR QUESTIONS – IT ALL MAKES ME FEEL GRATEFUL THAT PEOPLE HAVE BEEN ABLE TO CONNECT TO WHAT I DO. EVERYBODY’S MAIN MOTIVATION IN LIFE IS TO BE LISTENED TO, BY THEIR LOVED ONES, BY THEIR CHILDREN, BY SOCIETY. WE ALL WANT TO BE HEARD, AND TO BE ABLE TO DO SO IS ONE OF THE MOST VALIDATING PRIZES IN LIFE. TO BE PART OF THE LIVES OF SUCH INTELLIGENT AND CULTIVATED PEOPLE IS DEEPLY, DEEPLY EMOTIONALLY SATISFYING. I SENT OUT A MESSAGE AND PEOPLE RESPONDED. \n\n\n\n THAT IS THE BEST YOU CAN ASK FOR IN LIFE. \n\n\n\n – RICK OWENS \n\n\n\n BOB COLLERAN \n\n\n\n I FIRST BECAME AWARE OF RICK AROUND EIGHT YEARS AGO. I SAW [THIRD EYE BLIND MUSICIAN] STEPHAN JENKINS WEARING ONE OF THE T-SHIRTS AND HAD TO HAVE ONE. I LOVE THE BRAND BECAUSE IT APPROACHES THE SACRED AND HIGHEST DOMAIN OF THE ART WORLD, AND REFERENCES MY FORMATIVE INTERESTS, LIKE FITNESS AND VINTAGE ROCK. IT’S UNIQUE AND THE MOST CREATIVELY POWERFUL READY-TO-WEAR BRAND. \n\n\n\n HEY RICK, I SEE YOUR BRAND IS EXPANDING INTO FOG MACHINES, STROBE LAMPS AND AESOP PRODUCTS. WHAT CAN YOU SEE IT BRANCHING OUT INTO NEXT AND HOW DO YOU DO THAT WITHOUT ERODING THE INTEGRITY OF YOUR DESIGN LANGUAGE? \n\n\n\n RICK OWENS: THAT IS THE MILLION-DOLLAR QUESTION, EXPANSION AND MOVEMENT. YOU WANT MOMENTUM, AND I DON’T KNOW HOW MANY T-SHIRTS WE HAVE TO SELL TO SUPPORT EVERY EXAGGERATED RUNWAY PIECE THAT I MAKE. IT CAN GET A LITTLE TRICKY. I MEAN, THERE IS A LOT THAT GOES INTO SUPPORTING THE CREATIVITY OF THIS KIND OF VENTURE, AND AT FIRST I ALWAYS WROTE THE WHOLE EXPANSION AND COLLABORATION THING OFF AS HYPE, BUT IT ACTUALLY BECAME KIND OF FUN. HAVING BEEN IN THIS BUSINESS FOR A WHILE, I THOUGHT I MIGHT HAVE ISOLATED MYSELF A BIT TOO MUCH AND THIS WAS A CHANCE TO COMMUNICATE WITH MORE PEOPLE. \n\n\n\n IRONICALLY, I ALWAYS WANTED TO BE AS INCLUSIVE A BRAND AS POSSIBLE, BUT WHEN YOU ARE A NICHE BRAND YOU END UP EXCLUDING A LOT OF PEOPLE WHO DON’T THINK IT IS FOR THEM. FASHION IS COMMUNICATION – YOU WANT TO HAVE INTEGRITY, BUT YOU ALSO WANT TO BE AVAILABLE TO NEW PEOPLE, THOSE WHO ARE STARTING TO DEVELOP THEIR AESTHETIC BUT DON’T NECESSARILY KNOW WHAT DIRECTION TO GO IN. I GUESS YOU WANT TO BE DISCREET BUT AVAILABLE AT THE SAME TIME. I STILL HAVEN’T FIGURED OUT THE RIGHT BALANCE, BUT I DO KNOW THAT WE HAVE TO MOVE FORWARD AND EXPLORE, AND CAN’T BE SELF-SATISFIED AND REMAIN IN A SMALL CORNER RESTING ON OUR LAURELS. \n\n\n\n AS FOR THE FOG MACHINE [LAUGHS], THAT WAS MY FAVOURITE COLLAB. I FELT LIKE IT WAS AN EXAMPLE OF WHAT COLLABS CAN BE, INSTEAD OF JUST HYPE MONEY-MAKING MACHINES. THEY CAN BE INVENTIVE PARTNERSHIPS THAT CAN CREATE UNUSUAL ALLIANCES, AND THERE IS SOMETHING POSITIVE ABOUT HOW YOU CAN ALLY YOURSELF WITH SOMEONE YOU MIGHT NOT HAVE CONSIDERED BEFORE. THERE ARE BENEFITS AND THERE ARE DISADVANTAGES, WHERE IT SEEMS LIKE YOU’RE BEING EXPOSED TO TOO MANY PEOPLE, BUT, YOU KNOW, AT THIS STAGE IN THE GAME, I HAVE BEEN DOING IT FOR 20 YEARS, AND WE NEED TO EXPLORE AND TO PUSH OURSELVES TO HAVE SOME ADVENTURES. THANK YOU, BOB, FOR A VERY NICE QUESTION. THAT OUTFIT LOOKS REALLY GREAT ON YOU, TOO. \n\n\n\n ERIC COLÓN \n\n\n\n I FIRST BECAME AWARE OF RICK OWENS THROUGH INTERNET FORUMS AROUND 2013, BUT IT WASN’T UNTIL 2016 THAT I ACTUALLY BEGAN TO WEAR PIECES FROM THE BRAND. TO ME, THE BRAND IS THE OPPORTUNITY TO EXPRESS MYSELF IN THE MOST FUN WAY THROUGH EXCITING CLOTHING FROM AN ECCENTRIC DESIGNER WITH A HUMBLE BACKGROUND. WHAT MAKES RICK’S BRAND UNIQUE IS THE CONSISTENT DESIGN LANGUAGE THAT I SEE ACROSS ALL HIS CLOTHING, WHICH BRINGS SYNERGY TO EVERYTHING, EVEN ACROSS SEASONS. AS FOR RICK HIMSELF, I’VE ALWAYS APPRECIATED HOW CANDID AND SELF-DEPRECATING HE IS IN HIS INTERVIEWS ABOUT HIS LIFE, HIS INSPIRATIONS, AND HIS QUIRKS. \n\n\n\n HEY RICK, IT’S ERIC. THE ONE QUESTION I HAVE ALWAYS WANTED TO ASK YOU, OF ALL THE COLOURS YOU HAVE RELEASED – BLACK, MILK, DARK DUST, DARK SHADOW, THROAT, PEARL, PLUM, TOAD, BEAN, DNA DUST, ALL OF THAT – WHICH IS YOUR PERSONAL FAVOURITE? \n\n\n\n RICK OWENS: WELL, OBVIOUSLY BLACK IS MY FAVOURITE, BUT I LIKE OFF-WHITE, LIKE WEARING OLD WHITE T-SHIRTS, WHICH HAVE A LOT OF CONNOTATIONS FOR ME. YOU KNOW, THE OBVIOUS SID VICIOUS REFERENCE, BUT ALSO SATYAJIT RAY MOVIES, AND INDIAN BLACK-AND-WHITE MOVIES MADE IN THE 1930S AND 1940S. THEY TOLD THESE DELICATELY NUANCED STORIES OF FAMILY DYNAMICS IN INDIAN VILLAGES, AND THE PEOPLE WERE ALWAYS WEARING MODEST, DRAPED MUSLIN GARMENTS WITH THESE KIND OF WIDE-NECKED, LOOSE-STRETCH, OFF-WHITE T-SHIRTS. I WAS INTRODUCED TO SATYAJIT RAY MOVIES IN THE 1980S WHEN I WENT TO A FESTIVAL. THEY WERE SO MOVING BECAUSE THE STORIES THEY TOLD WERE SET IN THESE VERY SMALL VILLAGES IN INDIA BUT WERE UNIVERSAL STORIES OF LOVING DYNAMICS; THEY WERE SO TENDER. TO THIS DAY, I STILL HAVE THOSE MOVIES ON AS BACKGROUND IMAGERY BECAUSE OF THE BLACK AND WHITE AND JUST THE BEAUTY. I LIKE THE MOOD THEY SET FOR ME. I WILL HAVE THEM ON WHILE I’M SHOWERING, WITH SOME CLASSICAL MUSIC LIKE OPERA OR SOMETHING. THOSE T-SHIRTS, THAT DINGY WHITE, THAT IS THE COLOUR I LOVE THE MOST, ALONG WITH BLACK. I ALSO LIKE IT WHEN IT’S A BIT TINGED WITH GREY AND BLUE. OVER THE YEARS WE’VE HAD A MILLION NAMES FOR IT, WE’VE CALLED IT DINGE, PEARL, BUT ONE OF THE TIPS THAT I REALLY LEARNED OVER TIME IS THAT IT SHOULD NEVER BE WHITER THAN YOUR TEETH. BECAUSE IF YOU MAKE THE T-SHIRT DIRTIER THAN YOUR TEETH, THEN YOUR TEETH LOOK WHITER. THAT IS MY LITTLE BEAUTY TIP. THANK YOU FOR YOUR QUESTION, ERIC. THAT LEOPARD-PRINT CHIFFON JACKET YOU’RE WEARING IS ONE OF MY FAVOURITE THINGS; THE PEARL OF THAT CHIFFON IS ACTUALLY A LITTLE ON THE BLUE-GREY SIDE. IT CAME OUT JUST RIGHT AND I’M GLAD THAT YOU HAVE IT. \n\n\n\n FINN DELANEY \n\n\n\n I FIRST BECAME AWARE OF RICK AND HIS WORK WHEN I WAS LIVING IN MY SMALL HOME TOWN IN THE MIDDLE OF OXFORDSHIRE, ENGLAND. I WAS OBSESSED WITH QUEER CULTURE AND THE CONCEPT OF WHAT CAMP MEANT, BUT THROUGH A MORE SINISTER AND ‘DARK LENS’. MY IDOLS HAVE ALWAYS BEEN PERFORMANCE ARTISTS AND POLITICAL ACTIVISTS SUCH AS DAVID HOYLE, LEIGH BOWERY, AND PETE BURNS. RICK WAS THE FIRST BRAND I SAW THIS IN, AND I HAVE ALWAYS FELT ALIGNED WITH ITS WICKED SENSE OF HUMOUR, GLAMOUR, AND FIERCE EYE FOR DETAIL. THE IDEA OF HAVING A ‘DARK GLAMOUR’ APPROACH TO FASHION IS INTOXICATING TO ME. I CAN’T GET ENOUGH OF IT. RICK’S CLOTHES ARE SEXY AND COMPLICATED, BUT MORE IMPORTANTLY, THEY HAVE A POINT OF VIEW. THE BRAND AND RICK HIMSELF HAVE ALLOWED ME TO FIND WHO I AM, AND THROUGH THEM I’VE FOUND A COMMUNITY THAT LOVES QUEER CULTURE AND SIMILAR ART. WE’RE INTERNATIONAL, AND THOSE OLD PUNK OR NEW ROMANTIC CLIQUES YOU SAW ON THE KINGS ROAD (À LA WESTWOOD’S WORLDS END) ARE NOW CONNECTED THROUGH THE WEB, AND WE’RE ALL OVER THE GLOBE. THAT’S WHY RICK IS SO UNIQUE AND IMPORTANT TO MY LIFE. \n\n\n\n RICK, YOU’VE CREATED A WORLD THAT IS SORT OF INSULAR, BUT YOU HAVE ALSO NOW GARNERED AN AUDIENCE THAT TRANSCENDS GENDER AND AGE GROUPS AND RACE. HOW DO YOU THINK YOU HAVE DONE THIS AND HOW DO YOU THINK YOUR AUDIENCE REACTS TO IT? \n\n\n\n RICK OWENS: THANK YOU, FINN, FOR YOUR QUESTION. I THINK THAT ORIGINALLY I WAS FRUSTRATED AT HOW LIMITED THE STANDARDS OF CONTEMPORARY BEAUTY WERE. I FELT THAT THEY WERE RIGID AND NARROW AND BIASED, AND I’M GOING TO USE THE WORD BIGOTED, AND I THOUGHT I COULD PUT TOGETHER SOMETHING THAT MIGHT BE AN ALTERNATIVE TO THAT. I DON’T MEAN TO BE STRIDENTLY DIFFERENT, ALTHOUGH IT CAN SEEM LIKE THAT, AND EVEN THOUGH I DON’T MEAN TO, I PROBABLY AM TO A CERTAIN EXTENT BECAUSE IT TAKES ENERGY TO PROMOTE SOMETHING THAT IS NOT STANDARD. THE IDEA WAS TO BE INCLUSIVE AND TO BLUR THE BOUNDARIES OF RIGID AESTHETICS AND ALLOW MORE THINGS TO BE CONSIDERED BEAUTIFUL. IRONICALLY, I SOMETIMES I THINK I HAVE CREATED THIS WORLD THAT OTHER PEOPLE DON’T FEEL WELCOME IN. I DO REGRET THAT A LITTLE BIT, BUT I DO WHAT I CAN TO TRY AND KEEP IT AS OPEN AS POSSIBLE. THAT IS WHY I AM DOING COLLABORATIONS AND STUFF BECAUSE WE ARE SHOWING A DIFFERENT PART OF OUR WORLD – WE ARE OPEN. WE HAVE NO BARRIERS; WE ARE FRIENDLY. \n\n\n\n FINN, I THINK YOU ARE WEARING A JUMPSUIT, I CAN’T REALLY TELL, BUT I REALLY LOVE THAT FABRIC. IT REMINDS ME OF COTTON-CANDY TWILL, A VERY LOOSELY WOVEN SILK POLYAMIDE THAT GIVES IT AN AIRY BIZARRE NYLON FEELING. IT LOOKS GREAT ON YOU, AND I AM GLAD YOU GOT THAT. \n\n\n\n FIONA LUO \n\n\n\n I FIRST SAW RICK’S WORK ON TUMBLR AROUND 2013. I WORK IN FASHION, AND WHILE I LOVE THE WORK OF MANY DESIGNERS, NO OTHER PERSON OR LABEL’S WORK HAS MADE ME FEEL SO COMPLETELY MYSELF. THERE IS A PARTICULAR RELATIONSHIP BETWEEN BODY AND FABRIC, A KIND OF SYMBIOTIC SENSATION THAT I GET WHEN I WEAR THE CLOTHES. THERE IS AN INHERENT COMFORT IN KNOWING THAT THIS IS HOW I AM SUPPOSED TO ACTUALIZE MY BEING. PLUS, IT IS HOW I MET THE LOVE OF MY LIFE! I HAVE ETERNAL GRATITUDE FOR THAT! \n\n\n\n HEY RICK, SO THE QUESTION THAT I WANT TO ASK IS: WHEN DO YOU FEEL THE MOST TRULY ALIGNED WITHIN YOURSELF, AND WHAT ROLE DOES FASHION PLAY IN THAT? IF IT DOES. I AM SUPER-EXCITED TO HEAR WHAT YOU HAVE TO SAY, BECAUSE IT IS AN ANSWER I MYSELF AM CONSTANTLY TRYING TO FIND. \n\n\n\n RICK OWENS:HI FIONA, WHEN DO I FEEL MYSELF MOST TRULY ALIGNED? I THINK THAT’S WHEN I AM IN A GARDEN THE WEEK BEFORE I HAVE TO LAUNCH A COLLECTION. I HAVE A REAL SENSE OF PURPOSE; I HAVE ENOUGH RESOURCES I THINK, SO I CAN USE WHAT I HAVE GOT TO COME UP WITH THE BEST SOLUTION, AND THE ROLE THAT FASHION PLAYS IN THAT. I DON’T REALLY KNOW ANY MORE IF I AM THINKING ABOUT CLOTHES OR ABOUT A SCULPTURAL, LIGHT ENHANCEMENT KIND OF THING. I AM THINKING ABOUT CLOTHES AND CONSTRUCTION, BUT I AM ALSO KIND OF THINKING ABOUT A SENSE OF BEING. DOES THAT SOUND REALLY SUPER PRETENTIOUS? MAYBE, BUT I THINK ONE OF MY STRENGTHS IS THAT I HAVE ALWAYS BEEN ABLE TO LOOK AT THE BIG PICTURE. YOU KNOW THE PHRASE, YOU CAN’T SEE THE FOREST FOR THE TREES; WELL, I THINK I AM PRETTY GOOD AT SEEING THE FOREST. THE DOWNSIDE TO THAT IS THAT I GET IMPATIENT UNLESS I CAN FIND THE STRAIGHTEST LINE FROM POINT A TO POINT B. I DON’T ENJOY THE PROCESSES SO MUCH; I AM VERY GOAL ORIENTATED. \n\n\n\n SORRY, I KIND OF LOST MY TRAIN OF THOUGHT… YOU ARE ASKING ABOUT WHEN I FEEL MOST CENTERED. THAT PERIOD DURING A COLLECTION WHEN THERE IS EVERY POSSIBILITY, AND THE RESULTS COULD BE PERFECT, FANTASTIC AND TRANSCENDENT. THAT CREATIVE PERIOD WHERE YOU’RE ABOUT TO EXECUTE SOMETHING AND IT COULD BE THE GREATEST THING YOU’VE EVER DONE – IT HAS THE POTENTIAL TO BE PERFECT – THAT IS A VERY CENTERED MOMENT, WHEN YOU ARE KIND OF PULLING OUT AND APPLYING EVERYTHING YOU HAVE LEARNED. THAT’S A PRETTY DELICIOUS PLACE TO BE, AND I GUESS IT TAKES A WHILE TO GET THERE. YOU CAN’T COUNT ON HAVING IT ALL THE TIME. BY THE WAY, THE DRESS YOU’RE WEARING IS ONE OF MY FAVOURITE EVER, WHICH I GUESS MIGHT BE OBVIOUS BECAUSE WE ALWAYS KEEP IT IN THE COLLECTION, AND I FEEL LIKE IT IS A SIGNATURE SHAPE. IT LOOKS VERY PRETTY ON YOU. \n\n\n\n FRANKLIN LOGAN \n\n\n\n I AM A 3D ARTIST AND DEVELOPER BASED OUT OF LAS VEGAS. MY WIFE INA – WHO’S ALSO PARTICIPATING IN THIS! – AND I HAVE BEEN INTO FASHION AND MORE SPECIFICALLY, RICK’S CLOTHES, SINCE WE STARTED DATING NEARLY A DECADE AGO. I FIRST BECAME AWARE OF RICK OWENS WHEN I SAW HIS WORK POSTED ON ONLINE FORUMS. I WAS INSTANTLY HOOKED. FASHION TO ME HAS ALWAYS BEEN ABOUT PROJECTING OUTWARD WHO YOU ARE WITHIN, AND HOW THAT SINCERITY CAN ACTUALLY SERVE YOU AS A SUIT OF ARMOUR. THE INITIAL APPEAL OF THE BOLD AESTHETIC IS WHAT DREW ME IN, BUT READING MORE ABOUT HIM, IT WAS THE UNAPOLOGETIC SELF-EXPRESSION WITHIN RICK’S CHARACTER THAT HELPED SOLIDIFY HIM AS MY FAVOURITE. ALL OF HIS WORK IS A REFLECTION OF WHO HE IS – AND WE CAN ALL USE A REMINDER TO APPROACH OUR WORK AND OUR LIVES WITH MORE SINCERITY. \n\n\n\n HEY, RICK. YOU HAVE MENTIONED BEFORE THAT YOU HAVE EACH COLLECTION INSIDE OF YOU AND IT’S JUST A QUESTION OF UNEARTHING IT. BUT THIS THING YOU UNEARTH RESONATES WITH SO MANY PEOPLE AROUND THE WORLD. DO YOU FEEL THIS PART OF YOU IS SOMETHING YOU HAVE CULTIVATED OVER THE YEARS? IS IT THESE LIVED EXPERIENCES THAT RESONATE WITH PEOPLE OR IS IT SOMETHING INNATE TO YOU THAT TOUCHES SOMETHING INNATE TO EVERYONE ELSE? \n\n\n\n RICK OWENS: HEY, FRANKLIN, THANK YOU FOR YOUR QUESTION. I DO FEEL LIKE I HAVE EVERY COLLECTION INSIDE ME AND I JUST HAVE TO UNTANGLE IT, BUT THAT CAME AFTER A LONG PERIOD OF ACCUMULATING AND STUDYING A LOT OF IDEAS AND INFORMATION AND VISUALS AND ART AND LITERATURE. AT SOME POINT MY FAVOURITE THINGS STARTED RISING TO THE SURFACE AND I JUST BECAME SOMEONE WHO CREATED COMPOSITIONS OF THOSE THINGS. THESE WERE THINGS THAT A LOT OF PEOPLE RELATED TO, AND THEY APPRECIATED THESE COMPOSITIONS. I THINK OF IT LIKE POETRY, KIND OF LIKE A HAIKU, WHERE YOU SET A FEW WORDS AGAINST EACH OTHER, AND THEY CREATE A MOOD. THAT’S WHAT I THINK I’VE DONE. IT IS NOT AN INNATE THING; I DIDN’T INVENT ANYTHING. I JUST TOOK WHAT WAS OUT THERE IN THE WORLD AND REARRANGED IT TO CREATE MY OWN INTERPRETATION THAT MIGHT BE UNIQUE TO ME BUT WHICH IS FAMILIAR ENOUGH TO A LOT OF OTHER PEOPLE, SO THAT ULTIMATELY IT TURNS INTO A THING. I THINK I WAS LUCKY ENOUGH TO HAVE A KNACK FOR THAT, IN THE SAME WAY THAT SOME OF US ARE GOOD AT COOKING, SOME ARE GOOD AT SPORTS OR OTHER THINGS. \n\n\n\n YOU KNOW, NOBODY CAN REALLY EXPLAIN IT COMPLETELY BECAUSE OTHERWISE IT WOULD BE TOO EASY TO REPLICATE, AND THAT’S THE MAGIC. THERE IS MYSTERY TO HOW SOMETHING LIKE THIS STAYS UP IN THE AIR. THANK YOU FOR YOUR QUESTION; IT WAS FUN TO ANSWER. \n\n\n\n JESSIE ZHAO \n\n\n\n I FIRST BECAME AWARE OF RICK THROUGH MY HUSBAND AROUND FIVE YEARS AGO. I LOVE THE BRAND BECAUSE IT IS UNCOMPROMISING AND ENABLES ME TO FEEL MY MOST CONFIDENT. I HAVE HAD A JOURNEY OF LEARNING AND MAKING FRIENDS AND FAMILY WITH THE BRAND AND THE GREATER ART WORLD. \n\n\n\n HEY RICK, OUT OF YOUR ENTIRE CAREER, WHAT WAS THE MOMENT WHEN YOU FELT MOST PROUD OF YOURSELF? \n\n\n\n RICK OWENS: HEY, JESSIE. WOW! YOU LOOK AMAZING. THAT’S FROM THE LAST SHOW; MICHÈLE WORE A VERSION OF IT. WHEN WAS I THE PROUDEST? WELL, THERE HAVE BEEN A FEW MOMENTS. I THINK, I GOT A LITTLE BIT TEARY AT MY LAST MENSWEAR SHOW, WHEN I PLAYED THIS SISTERS OF MERCY SONG THAT I USED TO LISTEN TO OVER AND OVER AGAIN WHEN I WAS IN MY TWENTIES. WHEN I THINK OF THAT PERIOD, WHAT I CAN REMEMBER OF IT, I FELT LIKE I HAD POTENTIAL, BUT I WAS AFRAID OF NOT FULFILLING IT, SO THERE WAS FEAR AND FRUSTRATION, BECAUSE I FELT LIKE I MIGHT NOT MAKE IT. LISTENING TO THAT SONG OVER AND OVER AGAIN AT THE TIME, AND THEN BEING ABLE TO PLAY THAT SONG IN PARIS AT FULL BLAST, WITH REALLY GOOD LIGHTS AND REALLY GOOD MODELS, FOR A COLLECTION THAT I REALLY LIKED… I KIND OF LUXURIATED IN THE SATISFACTION OF HAVING TRAVELLED ALL THAT WAY AND HAVING FULFILLED THE POTENTIAL THAT I THOUGHT I HAD THEN. THAT WAS A VERY SATISFYING AND EMOTIONAL MOMENT. \n\n\n\n THE OTHER MOMENT THAT COMES TO MIND WAS WHEN I DID A RETROSPECTIVE AT THE TRIENNALE MUSEUM IN MILAN. THEY ALLOWED ME TO CURATE IT MYSELF, SO BEING ABLE TO KIND OF CELEBRATE WHAT I THOUGHT WERE MY SUCCESSES AND ELIMINATE ANY FLAWS OR THE MISTAKES THAT I THOUGHT I HAD MADE. I WAS ABLE TO PRESENT MYSELF AND INTERPRET MYSELF, WHICH FELT LIKE A UNIQUE POSITION. WELL, I GUESS INSTAGRAM IS TOTALLY LIKE THAT: YOU ARE PRESENTING THE PERSON YOU WANT TO BE, THE BEST ASPECTS AND THE MOST FLATTERING ANGLES, AND YOU ARE CREATING. I DON’T THINK ANYONE ELSE WOULD THINK OF INSTAGRAM THIS WAY, BUT WHAT I THOUGHT ABOUT WHEN I WAS DOING THAT TRIENNALE, THAT MUSEUM RETROSPECTIVE, WAS THAT IT WAS LIKE AN OBITUARY, NOT IN A GLOOMY WAY, BUT RATHER: I AM IN CONTROL OF MY NARRATIVE; I AM ABLE TO SUMMARISE WHO I AM, WHO I WAS, BOTH NOW AND FOR ANY RETROSPECTIVE I MIGHT HAVE IN THE FUTURE. IT FELT MONUMENTAL, SEEING IT COLLECTED ALL TOGETHER; I JUST KIND OF LUXURIATED IN THAT. IT WAS A PRETTY BIG MOMENT FOR ME. THANK YOU FOR THAT QUESTION. \n\n\n\n INA CLAVANO \n\n\n\n MY NAME IS INA, AND I FIRST BECAME AWARE OF RICK AROUND 10 YEARS AGO NOW. I’M BASED IN LAS VEGAS WITH MY HUSBAND FRANKLIN, AND WE USED TO SHARE RUNWAY LOOKS AND ‘FIT PICS’ OF PEOPLE WEARING AND STYLING RICK OWENS. AS PRE-CAREER KIDS WHO WERE BROKE WE ONLY DREAMED OF HAVING ENOUGH OF HIS PIECES TO FEEL THE MAGIC AND SELF-ASSURANCE HIS CLOTHING RADIATES WHEN WORN. THAT IS PART OF THE REASON WHY RICK OWENS IS SO IMPORTANT TO ME – THERE IS AN ESSENCE AND TRANSCENDENTAL NATURE IN HIS DESIGNS. IT’S NOT JUST WEARABLE ART BUT A WEARABLE EMOTION. IT FEELS LIKE ARMOUR FOR THE EVERYDAY WORLD, EVEN WITH THE SIMPLEST PIECES. DESPITE THE ENCHANTMENT THAT HIS CLOTHING ENCAPSULATES, IT IS STILL VERY HUMAN – BECAUSE OF HIM, BECAUSE HE IS NOT AFRAID TO ADMIT OR FORGET OR REMIND US ALL THAT HE IS JUST HUMAN. HE CREATES THE BALANCE THAT HE BELIEVES IN AND CONTRIBUTES IT TO THE WORLD. \n\n\n\n HEY RICK, YOU OFTEN TALK ABOUT THE ANGER OF YOUR YOUTH, AND HOW IT TRULY MANIFESTED IN YOUR ART AND CONTRIBUTIONS TO THE WORLD. DO YOU THINK THAT THE DEEP ANGER AND PAIN THAT A PERSON CAN’T ESCAPE CAN BE BEAUTIFUL, OR IF GIVEN THE CHANCE WOULD YOU BE RID OF YOURS COMPLETELY? THANKS FOR EVERYTHING. \n\n\n\n RICK OWENS: HI, INA, GOOD QUESTION. I GUESS I WOULDN’T; I WOULD LIKE TO MAKE SURE THOUGH THAT I DON’T OVERINDULGE, BECAUSE A LOT OF PEOPLE HAVE PAIN AND DISCOMFORT, AND MINE HASN’T BEEN THAT SPECIAL. I DO WONDER, HAD I BEEN COMPLETELY TRANQUIL AND SERENE AS A CHILD, WOULD THAT HAVE MADE ME NOT HAVE THE ENERGY TO REACT. WHEN I THINK BACK, I AM GRATEFUL FOR SITUATIONS THAT MADE ME WANT TO REACT. MAYBE I JUST ENJOY HOLDING RESENTMENT BECAUSE I AM A SCORPIO, AND WE ARE SUPPOSEDLY RESENTFUL. \n\n\n\n I THINK THAT TO BE CREATIVE YOU HAVE TO HAVE A CERTAIN SENSITIVITY TO THINGS, AND MAYBE I HAVE THAT AWARENESS. WE ALL HAVE OUR STRENGTHS. THERE IS NO RECIPE, BUT I ASSUME THAT WHAT I HAVE BEEN ABLE TO DO CREATIVELY HAS BEEN A RESPONSE TO THINGS THAT HAPPENED TO ME EARLIER. I DON’T WANT TO MAKE IT SOUND LIKE I WAS ABUSED OR ANYTHING, NOT AT ALL, BUT I WAS JUST REALLY SENSITIVE, AND I ENDED UP WHERE I SHOULDN’T HAVE BEEN. BUT IT ALL WORKED OUT, DIDN’T IT? OH, AND THAT KAFTAN THAT YOU’RE WEARING, I TRY AND PUT IT IN EVERY COLLECTION BECAUSE I THINK IT IS ONE OF OUR PIECES THAT KIND OF SAYS IT ALL. IT’S SEXY AND OPULENT, AND IT TAKES UP A LOT OF SPACE AROUND YOU. IT IS KIND OF FORMAL AND THIS WORLD CAN BE SO INFORMAL AND MESSY. YOU’RE ACTUALLY REMINDING ME THAT WE HAVE TO MAKE SURE WE HAVE THAT DRESS IN EVERY POSSIBLE FABRIC IN THE COLLECTION, SO THANK YOU FOR WEARING IT. \n\n\n\n KENNY RUFINO \n\n\n\n I PROBABLY FIRST HEARD ABOUT RICK OWENS AROUND 2003-2004 BUT REALLY BECAME A FAN A FEW YEARS LATER WHEN THE FIRST NEW YORK STORE OPENED ON HUDSON. THE RICK OWENS UNIVERSE CONNECTED WITH ME BECAUSE I FELT ATTRIBUTES OF THE BRAND THAT HAVE BEEN INSTRUMENTAL TO ME PERSONALLY, LIKE EXPRESSING YOUR INDIVIDUALITY, DEVELOPING A DISTINCT POINT OF VIEW, LIVING WITH YOUR CONTRADICTIONS. HOW RICK AND HIS WORK CONTINUE TO EVOLVE INTO NEW FORMS, INSPIRE DISCOURSE, AND REDEFINE OUR SOCIOCULTURAL MILIEU IS INSPIRING AND RARE. I DON’T KNOW WHERE HIS VISION WILL GO NEXT, BUT I KNOW I’LL BE THERE FOR THE RIDE. \n\n\n\n HI RICK, IF YOU HAD THE ABILITY TO GO BACK IN TIME AND ASK JUST ONE QUESTION TO ANY ONE PERSON IN HISTORY, WHO WOULD THAT PERSON BE AND WHAT WOULD YOU ASK? \n\n\n\n RICK OWENS: HI KENNY, I LIKE YOUR LOOK. I’M SURE I SHOULD COME UP WITH SOMEONE WAY MORE INTELLECTUAL AND ESOTERIC, BUT THE FIRST PERSON WHO COMES TO MIND, IS SALVADOR DALÍ, AND I WOULD ASK HIM TO DESIGN MY HOUSE. I AM FASCINATED WITH HOW HE NAVIGATED HIS LIFE. JUST HIS MIND-BENDING WAY OF THINKING, LIKE CREATING THAT SCULPTURE OF ALICE COOPER’S BRAIN OUT OF CROISSANTS AND ANTS. OH, AND WHEN HE SAID, ‘I DON’T DO DRUGS, I AM DRUGS.’ THERE IS A HELMUT NEWTON PICTURE OF SALVADOR DALÍ SHORTLY BEFORE HIS DEATH THAT I LOOK AT EVERY DAY; HE IS IN A WHEELCHAIR WEARING A SATIN GOWN WITH OXYGEN TUBES UP HIS NOSE. I LIKE HIS SENSE OF ABSURDITY AND NO LIMITS, AND ANYTHING CAN HAPPEN, AND DADAISM. I NEVER WANT TO FORGET THAT YOU CAN DO ANYTHING; YOU CAN SLIP AND SLIDE AND TURN INTO ANYTHING AND TURN INSIDE OUT. I JUST LIKE THE IDEA OF BEING ABLE TO LIVE IN AN ENVIRONMENT LED BY THAT KIND OF ATTITUDE. I HOPE THAT WAS A SATISFYING ENOUGH ANSWER TO YOUR QUESTION, KENNY. \n\n\n\n MATT CAMPO \n\n\n\n I HAD BEEN MILDLY FAMILIAR WITH RICK’S CLOTHES SINCE 2009, BUT COMING ACROSS THE MEN’S FALL/WINTER 2014 LOOKBOOK SHOT BY RICK CASTRO WHILE BROWSING SOME RANDOM FASHION WEBSITE WAS A REAL EYE OPENER. IT WAS THE FIRST TIME I’D TRULY FOUND A CONNECTION WITH THE BRAND ON A PERSONAL LEVEL. THE SHOOT WAS SUBVERSIVE AND BEAUTIFUL: STOIC, INTERGENERATIONAL MALE FORM, LEATHER-FETISH AESTHETICS, THE SEVERE CULT-LIKE CLOTHES. I WAS HOOKED AND IMMEDIATELY DIVED DOWN THE RABBIT HOLE INTO THE WORLD OF RICK OWENS. THE BRAND CONTAINS MULTITUDES; I FIND IT THE PERFECT VEHICLE FOR DISRUPTING THE EVERYDAY. EVERY PIECE POSSESSES A LEVEL OF CONSIDERATION THAT CARRIES THROUGH ANY OCCASION OR CIRCUMSTANCE: FROM PEAK COSY PANDEMIC WORK-FROM-HOME DAILY ISSUE TO OBSCENELY SCULPTURAL RUNWAY PIECES. RICK OWENS WORKS AS WELL FOR A GALA DINNER AS IT DOES WHEN JUST POPPING OUT TO GRAB GROCERIES. EITHER WAY, PEOPLE TAKE NOTICE. \n\n\n\n HEY RICK, OVER THE COURSE OF YOUR CAREER, YOU HAVE REINTRODUCED AND INTERPOLATED IDEAS AND THEMES FROM EARLIER COLLECTIONS, SOMETIMES MANY YEARS APART FROM THEIR DEBUT – IT’S ALMOST A WAGNERIAN SENSIBILITY OF LEITMOTIF. DO YOU HAVE A FAVOURITE IDEA, PATTERN OR CONCEPT THAT YOU HAVE BROUGHT BACK FROM AN EARLIER COLLECTION, AND DO YOU THINK IT WAS MORE SUCCESSFULLY EXECUTED THE SECOND TIME AROUND? THANKS! \n\n\n\n RICK OWENS: HEY MATT, I KNOW EXACTLY WHAT YOU’RE SAYING BUT I THINK I ONLY HAVE A CERTAIN NUMBER OF THINGS IN MY TOOLBOX, SO I AM GOING TO REPEAT MYSELF A LOT. I ADMIT THAT THERE HAVE BEEN TIMES IN THE PAST WHEN I DIDN’T HAVE FULL CONTROL OF ALL OF MY RESOURCES AND POWERS, SO I HADN’T LEARNED YET HOW TO EXECUTE THINGS IN A CERTAIN WAY. SO IT’S BEEN A PLEASURE TO GO BACK AND LOOK AT IT ANEW FROM A DIFFERENT ANGLE, AND REPEAT, MAYBE REPAIR, MAYBE ENHANCE OR JUST ENJOY REPEATING IN A DIFFERENT WAY. I THINK THERE IS A GOOD LESSON THERE – IF YOU HAD A GOOD IDEA ONCE, WHY SHOULD IT DISAPPEAR, WHY NOT REINTRODUCE IT AND WHY NOT CELEBRATE IT? GOOD IDEAS DON’T NECESSARILY NEED TO BE DISCARDED FOR THE NOVELTY OF SOMETHING NEW. IF SOMETHING IS GOOD, IT IS WORTH REPEATING. \n\n\n\n ONE OF MY BIGGEST LIFE LESSONS IS THAT YOU CAN GO BACK AND REPAIR THINGS, AND THIS APPLIES TO MISTAKES IN RELATIONSHIPS, TOO. I HAVE GONE BACK, AND I HAVE MADE AMENDS TO PEOPLE. THIS ISN’T LIKE A 12-STEP THING – I NEVER DID THAT – BUT YOU CAN THINK BACK ON SOMEONE THAT YOU FELT YOU DIDN’T TREAT AS WELL AS YOU WANTED TO AND DO SOMETHING ABOUT IT. GOOD QUESTION MATT, AND I’M GLAD YOU’RE WEARING THAT TOP, IT LOOKS GOOD ON AND I’M GLAD YOU’RE WEARING THAT TOP, IT LOOKS GOOD ON YOU. \n\n\n\n MICHAEL SMITH \n\n\n\n I FIRST BECAME AWARE OF RICK OWENS WHEN I WAS A SOPHOMORE IN COLLEGE AND STILL DRESSED VERY PREPPY. AT THE TIME I WASN’T A VERY BIG FAN, BUT IN A SHORT TIME I GREW OBSESSED. RICK IS OBVIOUSLY MY FAVOURITE CLOTHING BRAND, AND I FEEL VERY CONFIDENT AND COMFORTABLE IN HIS CLOTHES. THROUGH THE BRAND I HAVE ALSO MET SEVERAL OF MY FRIENDS IN NEW YORK, AND MANY OTHER PEOPLE WHO I HAVE A LOT IN COMMON WITH BESIDES CLOTHING TASTE. RICK’S DEFINING FEATURE HAS ALWAYS BEEN WORLD BUILDING, HOW HE CREATES A LOOK SO SPECIFIC AND SO RECOGNISABLE THAT IT BECOMES DIFFICULT TO OWN ANYTHING BESIDES RICK. EVERYTHING HE MAKES FITS SEAMLESSLY INTO HIS ARCHIVE OF WORK, AND IT IS POSSIBLE TO CREATE MANY DIFFERENT STYLES USING JUST RICK. \n\n\n\n HELLO, RICK. I’M WONDERING IF THERE’S ANYTHING YOU’VE WANTED TO DO WITH YOUR BRAND THAT YOU HAVEN’T BEEN ABLE TO ACCOMPLISH YET – LIKE AN OBJECT YOU’VE WANTED TO MAKE OR A RUNWAY CONCEPT YOU’VE WANTED TO DO – AND IF SO, WHAT THAT MIGHT BE? \n\n\n\n RICK OWENS: HI, MICHAEL, THE FIRST THING THAT COMES TO MIND IS ONE TIME WHEN WE WANTED TO DO A RUNWAY SHOW AND SET THE MODELS ON FIRE. I WAS SURE THAT WE COULD DO IT, AND I PUSHED AND PUSHED AND PUSHED. I KNOW THAT INSIDE THE PALAIS DE TOKYO IN THE 1950S, THEY HAD DONE AN INSTALLATION WITH FIRE, BUT FOR SOME REASON WITH CONTEMPORARY LEGALITIES AND SAFETY REGULATIONS, IT JUST WASN’T THE TIME TO SET PEOPLE ON FIRE IN THE GALLERY ITSELF. THEN KANYE DID IT IN A STADIUM SHOW IN THE MIDWEST OR SOMEWHERE; I MEAN A HUGE ARENA, GRANTED. BUT, YEAH, MODELS ON FIRE, I AM DISAPPOINTED I DIDN’T GET TO DO THAT. \n\n\n\n AS FAR AS COLLECTIONS GO, I SUPPOSE THERE HAVE BEEN INDUSTRIAL AND TECHNICAL BLOCKS IN THE PAST, BUT PART OF THE FUN OF WHAT I DO IS TAKING A SET AMOUNT OF RESOURCES AND LEARNING, AND COMING UP WITH A SATISFYING SOLUTION WITHIN A LIMITED AMOUNT OF TIME. THAT’S THE PUZZLE AND THE CHALLENGE, AND THERE IS RESTRAINT IN THAT; A CERTAIN AMOUNT OF MODESTY, THRIFTINESS AND RESOURCEFULNESS THAT YOU HAVE TO APPLY. \n\n\n\n PEOPLE SOMETIMES ASK ME IF I EVER WANT TO EXPLORE MORE ARCHITECTURALLY, BUT I AM KIND OF SATISFIED WITH TRANSFORMING THE ENVIRONMENTS THAT I’M IN. I UNDERSTAND THE AMBITION OF ARCHITECTURE, BUT I DON’T KNOW IF I COULD HANDLE THE LACK OF SPEED BECAUSE I AM SO USED TO THE RUNWAY CYCLE. I’VE PROBABLY BECOME ADDICTED TO IT. I TRY NOT TO BE TOO GREEDY, AND I AM TRYING TO DO THINGS WITHIN INTEGRITY. SO, YEAH, I THINK MORE ABOUT EVERYTHING I HAVE GOTTEN MORE THAN WHAT I HAVE MISSED OUT ON, AND I HAVE GOTTEN MORE THAN I EVER EXPECTED OR IMAGINED – I AM NOT COMPLAINING. THANK YOU, MICHAEL. \n\n\n\n OLIVER SUCHANEK \n\n\n\n I’M 27, LIVE IN LONDON, AND I’M AN AIRCRAFT ENGINEER. I WAS A BIT OF A SKATER KID GROWING UP, WITH THE GOTHS AND THE SCENE KIDS, SO MY FASHION BACKGROUND IS RIPPED SKINNY DENIM, TRASHED TEES, VANS AND HOODIES. I THINK THE FIRST TIME I BECAME AWARE OF RICK WAS WHEN I WAS AROUND 18 OR 19, WHEN FOR SOME REASON I TUNED INTO THE AUTUMN/WINTER 2013 PLINTH SHOW. IT WAS A EUREKA MOMENT FOR ME WHEN I REALISED THAT CLOTHES AREN’T JUST CLOTHES; THEY COULD BE GRITTY AND DIRTY AND ALL THE THINGS I WAS WEARING AS A KID, BUT JUST DONE DIFFERENTLY. RICK IS AN INSPIRATION AND I’VE STUCK WITH THE BRAND ESSENTIALLY FOR THE 10 YEARS I’VE BEEN INTO FASHION. I’VE DEVELOPED MY TASTES AND MY IMAGE ALONGSIDE RICK AS HE HAS DEVELOPED THROUGH THE ERAS OF HIS COLLECTIONS. IT’S INSPIRED AND PUSHED ME INTO WEARING THINGS THAT I NEVER THOUGHT I COULD POSSIBLY PULL OFF. A BIG PART OF THE LABEL’S UNIQUENESS IS THE CONSTANT DEVELOPMENT AND MORPHING OF ITSELF; YOU CAN SEE PREVIOUS COLLECTIONS IN CURRENT COLLECTIONS, BUT IN A WAY THAT ISN’T DERIVATIVE, STALE OR BORING. \n\n\n\n HI RICK, I TEND TO JUMP BETWEEN CREATIVE PROJECTS TOO QUICKLY AND I DON’T DEDICATE ENOUGH TIME TO EACH ONE. AS SOMEONE WHO HAS A LOT OF CREATIVE PROJECTS GOING, HOW DO YOU ENSURE THAT YOU DEDICATE ENOUGH TIME TO EACH ONE WITHOUT RUSHING? \n\n\n\n RICK OWENS: HI OLIVER, I DON’T KNOW IF I’M QUALIFIED TO ANSWER THAT QUESTION BECAUSE I DON’T KNOW IF I’VE MASTERED IT. I AM CONSCIOUS THAT YOU HAVE TO HAVE A CERTAIN KIND OF MOMENTUM TO GET TO A CERTAIN LEVEL AND WHEN YOU DO THAT THERE ARE THINGS THAT SLIP THROUGH THE CRACKS. I DO WONDER IF I AM GOING TO LOOK BACK AND REGRET HOW MANY THINGS I LET SLIP THROUGH; IT IS FRUSTRATING THAT YOU CAN’T HAVE YOUR FINGER ON EVERY SINGLE THING, BUT THERE HAS TO BE AN ELEMENT OF TRUST. I TRUSTED TOO MUCH AT SOME POINTS IN MY CAREER AND THINGS FELL APART, OR I DIDN’T TRUST AT ALL AND HELD THE REIGNS TOO TIGHTLY AND WAS TOO UPTIGHT, AND THAT DIDN’T WORK EITHER. THEN THERE ARE THE TIMES WHEN I FOUND THE RIGHT BALANCE, WHERE I TRUSTED ENOUGH AND ALLOWED PEOPLE TO PARTICIPATE IN A COMFORTABLE WAY, AND I GOT THE RESULTS THAT I WANTED. IT IS A KIND OF A CONSTANT BALANCE YOU HAVE TO TRY AND MAINTAIN, AND IT IS REALLY TRICKY. BECAUSE YOU HAVE TO WORK WITH A LOT OF PEOPLE WHO ARE PUTTING THEIR OWN PERSONAL EMOTIONAL INVESTMENTS INTO SOMETHING WITH YOU, AND YOU HAVE TO RESPECT THAT. BEING ABLE TO RESPECT IT AND DIRECT IT AND COLLABORATE WITH THAT KIND OF EMOTIONAL FORCE, THAT IS A FRAGILE AND DELICATE THING. AND IT’S NOT LIKE I AM A MASTER OF IT. BUT GOOD LUCK WITH THAT. IF YOU ARE CONSCIOUS OF IT OLIVER, THEN YOU ARE ALREADY LOOKING FOR AN ANSWER, AND THAT’S A POSITIVE THING. \n\n\n\n WILLIAM BRAGGADOCIO \n\n\n\n IN A PAST CAREER, I WAS A BUYER FOR A CHICAGO BOUTIQUE CALLED GALLERY AESTHETE. I WAS LUCKY ENOUGH TO TRAVEL TO THE RICK OWENS SHOWROOMS AND RUNWAY SHOWS. I NOW WORK IN TV AND FILM PRODUCTION AS AN ASSISTANT COSTUME DESIGNER, BUT I STILL MAKE A POINT OF KEEPING UP WITH THE RICK OWENS BRAND. I DISCOVERED RICK OWENS BACK IN HIGH SCHOOL WHEN I WAS VIEWING SOME COLLECTIONS (EMBARRASSINGLY, I RECALL IT WAS DOLCE AND GABBANA). IT WAS HIS CRUST COLLECTION [AUTUMN/WINTER 2009]. AT THAT MOMENT, SOMETHING FLIPPED ON IN ME. IT FELT LIKE I HAD BEEN LOOKING FOR THIS, AND IT FELL INTO MY LAP. EVER SINCE, I HAVE BEEN DEEPLY ENAMOURED WITH HIS BRAND. PERSONALLY, RICK OWENS IS ESSENTIAL TO MY EVERYDAY. EVERY PIECE I COLLECT FEELS LIKE ADDING ART TO MY LIFE. IT MAKES MY WORLD FEEL A LITTLE MORE BEAUTIFUL AND SPECIAL. \n\n\n\n HELLO, MR OWENS, WHAT WOULD YOU SAY IS A TRANSCENDENT MOMENT IN YOUR CAREER AS A DESIGNER? \n\n\n\n RICK OWENS: HI, WILLIAM. I HAVE HAD MORE TRANSCENDENT MOMENTS THAN I EVER REALLY HAD THE IMAGINATION TO THINK OF. AS A DESIGNER, PEOPLE SOMETIMES ASK ME ABOUT THE HIGH OF THE RUNWAY SHOW, AND THERE IS A HIGH, BUT TO ME THE RUNWAY-SHOW EXPERIENCE IS ALWAYS ONE OF GREAT PEACE. I FEEL A SENSE OF SATISFACTION, LIKE IT’S A GOOD SOLUTION TO A PUZZLE; LIKE I HAVE BEEN ABLE TO COME UP WITH A DECENT CONVINCING PLAUSIBLE STORY, USING THE LIMITED RESOURCES AND TIME THAT I HAD. YOU WORK HARD TO MAKE SURE IT HAPPENS. IT IS NOT LIKE I LEAVE A LOT OF ELEMENTS TO CHANCE, I AM THE ONE THERE GUIDING IT ALONG AND MAKING SURE IT COMES OUT THE WAY I WANT IT TO. I AM NOT SAYING THAT IN A GLOATING WAY BECAUSE IT TAKES A LOT OF EFFORT TO MAKE THAT HAPPEN AND I PUT THAT EFFORT IN. IT IS NOT EXACTLY TRANSCENDENT, BUT IT IS DEEPLY SATISFYING BECAUSE EVERYTHING FALLS INTO PLACE, AND YOU GET TO SEE THE FINAL RESULTS. THAT LITTLE EMOTIONAL TRANSCENDENT MOMENT COMES WHEN I FEEL LIKE, ‘OH I HAVE GOT ENOUGH ELEMENTS IN THIS STORY FOR IT NOW TO TRULY WORK.’ I THINK THAT MIGHT BE TRANSCENDENT AND THAT USUALLY HAPPENS A WEEK BEFORE I HAVE TO LAUNCH THE COLLECTION, USUALLY ON A SATURDAY NIGHT, LATE AT NIGHT, IN AN EMPTY FACTORY IN THE MIDDLE OF NOWHERE IN ITALY, WHEN I AM BY MYSELF. \n\n\n\n BESIDES THAT, THERE HAVE BEEN TIMES I REMEMBER BEING HIGH ON A DANCE FLOOR, AND FEELING LIKE THAT’S THE MOST TRANSCENDENT THING I COULD THINK OF ON A SATURDAY NIGHT, BUT BEING ALONE IN A FACTORY AND HAVING EVERYTHING FALL INTO PLACE – THAT MIGHT BE TRANSCENDENCE FOR ME NOW. THANKS AGAIN FOR YOUR QUESTION, WILLIAM.",
        "link": "https://www.rickowens.eu/en/MX/interviews/system-issue-19"
    },
    {
        "title": "SYSTEM — ‘HEY RICK, THE ONE THING I’VE ALWAYS WANTED TO ASK YOU IS...’ — SPRING SUMMER 2022 ISSUE 19",
        "content": "SYSTEM — ‘HEY RICK, THE ONE THING I’VE ALWAYS WANTED TO ASK YOU IS...’ — SPRING SUMMER 2022 ISSUE 19 \n\n\n\n I’M CURRENTLY READING A JOSEPH BEUYS BIOGRAPHY, WHICH IS VERY SOOTHING. I FEEL THAT HIS WAS A SELF-CONTAINED WORLD THAT I WOULD KIND OF ASPIRE TO. I KNOW THAT A LOT OF THAT IS MY OWN PROJECTION, MY FANTASY AND MY INTERPRETATION OF WHO JOSEPH BEUYS WAS, BUT I ALLOW MYSELF TO ROMANTICISE IT BECAUSE THAT MAKES IT MORE FUN. I SUSPECT THAT PEOPLE DO KIND OF THE SAME WITH ME. THEY ARE ROMANTICIZING ME TO FIT THEIR NEEDS, AND THAT’S FINE. I AM HAPPY TO BE SOME KIND OF SYMBOL THAT THEY CAN ELABORATE ON. \n\n\n\n CONVERSELY, I SEE MYSELF IN THEM, BECAUSE WE ARE ALL ALIKE. THE THINGS I TALK ABOUT IN EVERY SHOW ARE PRIMAL, UNIVERSAL CONCERNS ABOUT EMPATHY, INCLUSION, EXCLUSION, SHAME, PRIDE, SELF-LOATHING, AGGRESSION, AND THE NEED FOR ACCEPTANCE. BY EXAMINING THESE THINGS AND BY DEMYSTIFYING THEM, AND BY ME REASSURING OTHER PEOPLE THAT WE HAVE ALL FELT AND EXPERIENCED THEM – THAT IS WHAT I THINK PEOPLE HAVE RESPONDED TO. \n\n\n\n LISTENING TO THESE PEOPLE’S STORIES, SEEING THEM LOOKING SO GREAT IN THE LOOKS WE’VE DESIGNED, AND ANSWERING THEIR QUESTIONS – IT ALL MAKES ME FEEL GRATEFUL THAT PEOPLE HAVE BEEN ABLE TO CONNECT TO WHAT I DO. EVERYBODY’S MAIN MOTIVATION IN LIFE IS TO BE LISTENED TO, BY THEIR LOVED ONES, BY THEIR CHILDREN, BY SOCIETY. WE ALL WANT TO BE HEARD, AND TO BE ABLE TO DO SO IS ONE OF THE MOST VALIDATING PRIZES IN LIFE. TO BE PART OF THE LIVES OF SUCH INTELLIGENT AND CULTIVATED PEOPLE IS DEEPLY, DEEPLY EMOTIONALLY SATISFYING. I SENT OUT A MESSAGE AND PEOPLE RESPONDED. \n\n\n\n THAT IS THE BEST YOU CAN ASK FOR IN LIFE. \n\n\n\n – RICK OWENS \n\n\n\n BOB COLLERAN \n\n\n\n I FIRST BECAME AWARE OF RICK AROUND EIGHT YEARS AGO. I SAW [THIRD EYE BLIND MUSICIAN] STEPHAN JENKINS WEARING ONE OF THE T-SHIRTS AND HAD TO HAVE ONE. I LOVE THE BRAND BECAUSE IT APPROACHES THE SACRED AND HIGHEST DOMAIN OF THE ART WORLD, AND REFERENCES MY FORMATIVE INTERESTS, LIKE FITNESS AND VINTAGE ROCK. IT’S UNIQUE AND THE MOST CREATIVELY POWERFUL READY-TO-WEAR BRAND. \n\n\n\n HEY RICK, I SEE YOUR BRAND IS EXPANDING INTO FOG MACHINES, STROBE LAMPS AND AESOP PRODUCTS. WHAT CAN YOU SEE IT BRANCHING OUT INTO NEXT AND HOW DO YOU DO THAT WITHOUT ERODING THE INTEGRITY OF YOUR DESIGN LANGUAGE? \n\n\n\n RICK OWENS: THAT IS THE MILLION-DOLLAR QUESTION, EXPANSION AND MOVEMENT. YOU WANT MOMENTUM, AND I DON’T KNOW HOW MANY T-SHIRTS WE HAVE TO SELL TO SUPPORT EVERY EXAGGERATED RUNWAY PIECE THAT I MAKE. IT CAN GET A LITTLE TRICKY. I MEAN, THERE IS A LOT THAT GOES INTO SUPPORTING THE CREATIVITY OF THIS KIND OF VENTURE, AND AT FIRST I ALWAYS WROTE THE WHOLE EXPANSION AND COLLABORATION THING OFF AS HYPE, BUT IT ACTUALLY BECAME KIND OF FUN. HAVING BEEN IN THIS BUSINESS FOR A WHILE, I THOUGHT I MIGHT HAVE ISOLATED MYSELF A BIT TOO MUCH AND THIS WAS A CHANCE TO COMMUNICATE WITH MORE PEOPLE. \n\n\n\n IRONICALLY, I ALWAYS WANTED TO BE AS INCLUSIVE A BRAND AS POSSIBLE, BUT WHEN YOU ARE A NICHE BRAND YOU END UP EXCLUDING A LOT OF PEOPLE WHO DON’T THINK IT IS FOR THEM. FASHION IS COMMUNICATION – YOU WANT TO HAVE INTEGRITY, BUT YOU ALSO WANT TO BE AVAILABLE TO NEW PEOPLE, THOSE WHO ARE STARTING TO DEVELOP THEIR AESTHETIC BUT DON’T NECESSARILY KNOW WHAT DIRECTION TO GO IN. I GUESS YOU WANT TO BE DISCREET BUT AVAILABLE AT THE SAME TIME. I STILL HAVEN’T FIGURED OUT THE RIGHT BALANCE, BUT I DO KNOW THAT WE HAVE TO MOVE FORWARD AND EXPLORE, AND CAN’T BE SELF-SATISFIED AND REMAIN IN A SMALL CORNER RESTING ON OUR LAURELS. \n\n\n\n AS FOR THE FOG MACHINE [LAUGHS], THAT WAS MY FAVOURITE COLLAB. I FELT LIKE IT WAS AN EXAMPLE OF WHAT COLLABS CAN BE, INSTEAD OF JUST HYPE MONEY-MAKING MACHINES. THEY CAN BE INVENTIVE PARTNERSHIPS THAT CAN CREATE UNUSUAL ALLIANCES, AND THERE IS SOMETHING POSITIVE ABOUT HOW YOU CAN ALLY YOURSELF WITH SOMEONE YOU MIGHT NOT HAVE CONSIDERED BEFORE. THERE ARE BENEFITS AND THERE ARE DISADVANTAGES, WHERE IT SEEMS LIKE YOU’RE BEING EXPOSED TO TOO MANY PEOPLE, BUT, YOU KNOW, AT THIS STAGE IN THE GAME, I HAVE BEEN DOING IT FOR 20 YEARS, AND WE NEED TO EXPLORE AND TO PUSH OURSELVES TO HAVE SOME ADVENTURES. THANK YOU, BOB, FOR A VERY NICE QUESTION. THAT OUTFIT LOOKS REALLY GREAT ON YOU, TOO. \n\n\n\n ERIC COLÓN \n\n\n\n I FIRST BECAME AWARE OF RICK OWENS THROUGH INTERNET FORUMS AROUND 2013, BUT IT WASN’T UNTIL 2016 THAT I ACTUALLY BEGAN TO WEAR PIECES FROM THE BRAND. TO ME, THE BRAND IS THE OPPORTUNITY TO EXPRESS MYSELF IN THE MOST FUN WAY THROUGH EXCITING CLOTHING FROM AN ECCENTRIC DESIGNER WITH A HUMBLE BACKGROUND. WHAT MAKES RICK’S BRAND UNIQUE IS THE CONSISTENT DESIGN LANGUAGE THAT I SEE ACROSS ALL HIS CLOTHING, WHICH BRINGS SYNERGY TO EVERYTHING, EVEN ACROSS SEASONS. AS FOR RICK HIMSELF, I’VE ALWAYS APPRECIATED HOW CANDID AND SELF-DEPRECATING HE IS IN HIS INTERVIEWS ABOUT HIS LIFE, HIS INSPIRATIONS, AND HIS QUIRKS. \n\n\n\n HEY RICK, IT’S ERIC. THE ONE QUESTION I HAVE ALWAYS WANTED TO ASK YOU, OF ALL THE COLOURS YOU HAVE RELEASED – BLACK, MILK, DARK DUST, DARK SHADOW, THROAT, PEARL, PLUM, TOAD, BEAN, DNA DUST, ALL OF THAT – WHICH IS YOUR PERSONAL FAVOURITE? \n\n\n\n RICK OWENS: WELL, OBVIOUSLY BLACK IS MY FAVOURITE, BUT I LIKE OFF-WHITE, LIKE WEARING OLD WHITE T-SHIRTS, WHICH HAVE A LOT OF CONNOTATIONS FOR ME. YOU KNOW, THE OBVIOUS SID VICIOUS REFERENCE, BUT ALSO SATYAJIT RAY MOVIES, AND INDIAN BLACK-AND-WHITE MOVIES MADE IN THE 1930S AND 1940S. THEY TOLD THESE DELICATELY NUANCED STORIES OF FAMILY DYNAMICS IN INDIAN VILLAGES, AND THE PEOPLE WERE ALWAYS WEARING MODEST, DRAPED MUSLIN GARMENTS WITH THESE KIND OF WIDE-NECKED, LOOSE-STRETCH, OFF-WHITE T-SHIRTS. I WAS INTRODUCED TO SATYAJIT RAY MOVIES IN THE 1980S WHEN I WENT TO A FESTIVAL. THEY WERE SO MOVING BECAUSE THE STORIES THEY TOLD WERE SET IN THESE VERY SMALL VILLAGES IN INDIA BUT WERE UNIVERSAL STORIES OF LOVING DYNAMICS; THEY WERE SO TENDER. TO THIS DAY, I STILL HAVE THOSE MOVIES ON AS BACKGROUND IMAGERY BECAUSE OF THE BLACK AND WHITE AND JUST THE BEAUTY. I LIKE THE MOOD THEY SET FOR ME. I WILL HAVE THEM ON WHILE I’M SHOWERING, WITH SOME CLASSICAL MUSIC LIKE OPERA OR SOMETHING. THOSE T-SHIRTS, THAT DINGY WHITE, THAT IS THE COLOUR I LOVE THE MOST, ALONG WITH BLACK. I ALSO LIKE IT WHEN IT’S A BIT TINGED WITH GREY AND BLUE. OVER THE YEARS WE’VE HAD A MILLION NAMES FOR IT, WE’VE CALLED IT DINGE, PEARL, BUT ONE OF THE TIPS THAT I REALLY LEARNED OVER TIME IS THAT IT SHOULD NEVER BE WHITER THAN YOUR TEETH. BECAUSE IF YOU MAKE THE T-SHIRT DIRTIER THAN YOUR TEETH, THEN YOUR TEETH LOOK WHITER. THAT IS MY LITTLE BEAUTY TIP. THANK YOU FOR YOUR QUESTION, ERIC. THAT LEOPARD-PRINT CHIFFON JACKET YOU’RE WEARING IS ONE OF MY FAVOURITE THINGS; THE PEARL OF THAT CHIFFON IS ACTUALLY A LITTLE ON THE BLUE-GREY SIDE. IT CAME OUT JUST RIGHT AND I’M GLAD THAT YOU HAVE IT. \n\n\n\n FINN DELANEY \n\n\n\n I FIRST BECAME AWARE OF RICK AND HIS WORK WHEN I WAS LIVING IN MY SMALL HOME TOWN IN THE MIDDLE OF OXFORDSHIRE, ENGLAND. I WAS OBSESSED WITH QUEER CULTURE AND THE CONCEPT OF WHAT CAMP MEANT, BUT THROUGH A MORE SINISTER AND ‘DARK LENS’. MY IDOLS HAVE ALWAYS BEEN PERFORMANCE ARTISTS AND POLITICAL ACTIVISTS SUCH AS DAVID HOYLE, LEIGH BOWERY, AND PETE BURNS. RICK WAS THE FIRST BRAND I SAW THIS IN, AND I HAVE ALWAYS FELT ALIGNED WITH ITS WICKED SENSE OF HUMOUR, GLAMOUR, AND FIERCE EYE FOR DETAIL. THE IDEA OF HAVING A ‘DARK GLAMOUR’ APPROACH TO FASHION IS INTOXICATING TO ME. I CAN’T GET ENOUGH OF IT. RICK’S CLOTHES ARE SEXY AND COMPLICATED, BUT MORE IMPORTANTLY, THEY HAVE A POINT OF VIEW. THE BRAND AND RICK HIMSELF HAVE ALLOWED ME TO FIND WHO I AM, AND THROUGH THEM I’VE FOUND A COMMUNITY THAT LOVES QUEER CULTURE AND SIMILAR ART. WE’RE INTERNATIONAL, AND THOSE OLD PUNK OR NEW ROMANTIC CLIQUES YOU SAW ON THE KINGS ROAD (À LA WESTWOOD’S WORLDS END) ARE NOW CONNECTED THROUGH THE WEB, AND WE’RE ALL OVER THE GLOBE. THAT’S WHY RICK IS SO UNIQUE AND IMPORTANT TO MY LIFE. \n\n\n\n RICK, YOU’VE CREATED A WORLD THAT IS SORT OF INSULAR, BUT YOU HAVE ALSO NOW GARNERED AN AUDIENCE THAT TRANSCENDS GENDER AND AGE GROUPS AND RACE. HOW DO YOU THINK YOU HAVE DONE THIS AND HOW DO YOU THINK YOUR AUDIENCE REACTS TO IT? \n\n\n\n RICK OWENS: THANK YOU, FINN, FOR YOUR QUESTION. I THINK THAT ORIGINALLY I WAS FRUSTRATED AT HOW LIMITED THE STANDARDS OF CONTEMPORARY BEAUTY WERE. I FELT THAT THEY WERE RIGID AND NARROW AND BIASED, AND I’M GOING TO USE THE WORD BIGOTED, AND I THOUGHT I COULD PUT TOGETHER SOMETHING THAT MIGHT BE AN ALTERNATIVE TO THAT. I DON’T MEAN TO BE STRIDENTLY DIFFERENT, ALTHOUGH IT CAN SEEM LIKE THAT, AND EVEN THOUGH I DON’T MEAN TO, I PROBABLY AM TO A CERTAIN EXTENT BECAUSE IT TAKES ENERGY TO PROMOTE SOMETHING THAT IS NOT STANDARD. THE IDEA WAS TO BE INCLUSIVE AND TO BLUR THE BOUNDARIES OF RIGID AESTHETICS AND ALLOW MORE THINGS TO BE CONSIDERED BEAUTIFUL. IRONICALLY, I SOMETIMES I THINK I HAVE CREATED THIS WORLD THAT OTHER PEOPLE DON’T FEEL WELCOME IN. I DO REGRET THAT A LITTLE BIT, BUT I DO WHAT I CAN TO TRY AND KEEP IT AS OPEN AS POSSIBLE. THAT IS WHY I AM DOING COLLABORATIONS AND STUFF BECAUSE WE ARE SHOWING A DIFFERENT PART OF OUR WORLD – WE ARE OPEN. WE HAVE NO BARRIERS; WE ARE FRIENDLY. \n\n\n\n FINN, I THINK YOU ARE WEARING A JUMPSUIT, I CAN’T REALLY TELL, BUT I REALLY LOVE THAT FABRIC. IT REMINDS ME OF COTTON-CANDY TWILL, A VERY LOOSELY WOVEN SILK POLYAMIDE THAT GIVES IT AN AIRY BIZARRE NYLON FEELING. IT LOOKS GREAT ON YOU, AND I AM GLAD YOU GOT THAT. \n\n\n\n FIONA LUO \n\n\n\n I FIRST SAW RICK’S WORK ON TUMBLR AROUND 2013. I WORK IN FASHION, AND WHILE I LOVE THE WORK OF MANY DESIGNERS, NO OTHER PERSON OR LABEL’S WORK HAS MADE ME FEEL SO COMPLETELY MYSELF. THERE IS A PARTICULAR RELATIONSHIP BETWEEN BODY AND FABRIC, A KIND OF SYMBIOTIC SENSATION THAT I GET WHEN I WEAR THE CLOTHES. THERE IS AN INHERENT COMFORT IN KNOWING THAT THIS IS HOW I AM SUPPOSED TO ACTUALIZE MY BEING. PLUS, IT IS HOW I MET THE LOVE OF MY LIFE! I HAVE ETERNAL GRATITUDE FOR THAT! \n\n\n\n HEY RICK, SO THE QUESTION THAT I WANT TO ASK IS: WHEN DO YOU FEEL THE MOST TRULY ALIGNED WITHIN YOURSELF, AND WHAT ROLE DOES FASHION PLAY IN THAT? IF IT DOES. I AM SUPER-EXCITED TO HEAR WHAT YOU HAVE TO SAY, BECAUSE IT IS AN ANSWER I MYSELF AM CONSTANTLY TRYING TO FIND. \n\n\n\n RICK OWENS:HI FIONA, WHEN DO I FEEL MYSELF MOST TRULY ALIGNED? I THINK THAT’S WHEN I AM IN A GARDEN THE WEEK BEFORE I HAVE TO LAUNCH A COLLECTION. I HAVE A REAL SENSE OF PURPOSE; I HAVE ENOUGH RESOURCES I THINK, SO I CAN USE WHAT I HAVE GOT TO COME UP WITH THE BEST SOLUTION, AND THE ROLE THAT FASHION PLAYS IN THAT. I DON’T REALLY KNOW ANY MORE IF I AM THINKING ABOUT CLOTHES OR ABOUT A SCULPTURAL, LIGHT ENHANCEMENT KIND OF THING. I AM THINKING ABOUT CLOTHES AND CONSTRUCTION, BUT I AM ALSO KIND OF THINKING ABOUT A SENSE OF BEING. DOES THAT SOUND REALLY SUPER PRETENTIOUS? MAYBE, BUT I THINK ONE OF MY STRENGTHS IS THAT I HAVE ALWAYS BEEN ABLE TO LOOK AT THE BIG PICTURE. YOU KNOW THE PHRASE, YOU CAN’T SEE THE FOREST FOR THE TREES; WELL, I THINK I AM PRETTY GOOD AT SEEING THE FOREST. THE DOWNSIDE TO THAT IS THAT I GET IMPATIENT UNLESS I CAN FIND THE STRAIGHTEST LINE FROM POINT A TO POINT B. I DON’T ENJOY THE PROCESSES SO MUCH; I AM VERY GOAL ORIENTATED. \n\n\n\n SORRY, I KIND OF LOST MY TRAIN OF THOUGHT… YOU ARE ASKING ABOUT WHEN I FEEL MOST CENTERED. THAT PERIOD DURING A COLLECTION WHEN THERE IS EVERY POSSIBILITY, AND THE RESULTS COULD BE PERFECT, FANTASTIC AND TRANSCENDENT. THAT CREATIVE PERIOD WHERE YOU’RE ABOUT TO EXECUTE SOMETHING AND IT COULD BE THE GREATEST THING YOU’VE EVER DONE – IT HAS THE POTENTIAL TO BE PERFECT – THAT IS A VERY CENTERED MOMENT, WHEN YOU ARE KIND OF PULLING OUT AND APPLYING EVERYTHING YOU HAVE LEARNED. THAT’S A PRETTY DELICIOUS PLACE TO BE, AND I GUESS IT TAKES A WHILE TO GET THERE. YOU CAN’T COUNT ON HAVING IT ALL THE TIME. BY THE WAY, THE DRESS YOU’RE WEARING IS ONE OF MY FAVOURITE EVER, WHICH I GUESS MIGHT BE OBVIOUS BECAUSE WE ALWAYS KEEP IT IN THE COLLECTION, AND I FEEL LIKE IT IS A SIGNATURE SHAPE. IT LOOKS VERY PRETTY ON YOU. \n\n\n\n FRANKLIN LOGAN \n\n\n\n I AM A 3D ARTIST AND DEVELOPER BASED OUT OF LAS VEGAS. MY WIFE INA – WHO’S ALSO PARTICIPATING IN THIS! – AND I HAVE BEEN INTO FASHION AND MORE SPECIFICALLY, RICK’S CLOTHES, SINCE WE STARTED DATING NEARLY A DECADE AGO. I FIRST BECAME AWARE OF RICK OWENS WHEN I SAW HIS WORK POSTED ON ONLINE FORUMS. I WAS INSTANTLY HOOKED. FASHION TO ME HAS ALWAYS BEEN ABOUT PROJECTING OUTWARD WHO YOU ARE WITHIN, AND HOW THAT SINCERITY CAN ACTUALLY SERVE YOU AS A SUIT OF ARMOUR. THE INITIAL APPEAL OF THE BOLD AESTHETIC IS WHAT DREW ME IN, BUT READING MORE ABOUT HIM, IT WAS THE UNAPOLOGETIC SELF-EXPRESSION WITHIN RICK’S CHARACTER THAT HELPED SOLIDIFY HIM AS MY FAVOURITE. ALL OF HIS WORK IS A REFLECTION OF WHO HE IS – AND WE CAN ALL USE A REMINDER TO APPROACH OUR WORK AND OUR LIVES WITH MORE SINCERITY. \n\n\n\n HEY, RICK. YOU HAVE MENTIONED BEFORE THAT YOU HAVE EACH COLLECTION INSIDE OF YOU AND IT’S JUST A QUESTION OF UNEARTHING IT. BUT THIS THING YOU UNEARTH RESONATES WITH SO MANY PEOPLE AROUND THE WORLD. DO YOU FEEL THIS PART OF YOU IS SOMETHING YOU HAVE CULTIVATED OVER THE YEARS? IS IT THESE LIVED EXPERIENCES THAT RESONATE WITH PEOPLE OR IS IT SOMETHING INNATE TO YOU THAT TOUCHES SOMETHING INNATE TO EVERYONE ELSE? \n\n\n\n RICK OWENS: HEY, FRANKLIN, THANK YOU FOR YOUR QUESTION. I DO FEEL LIKE I HAVE EVERY COLLECTION INSIDE ME AND I JUST HAVE TO UNTANGLE IT, BUT THAT CAME AFTER A LONG PERIOD OF ACCUMULATING AND STUDYING A LOT OF IDEAS AND INFORMATION AND VISUALS AND ART AND LITERATURE. AT SOME POINT MY FAVOURITE THINGS STARTED RISING TO THE SURFACE AND I JUST BECAME SOMEONE WHO CREATED COMPOSITIONS OF THOSE THINGS. THESE WERE THINGS THAT A LOT OF PEOPLE RELATED TO, AND THEY APPRECIATED THESE COMPOSITIONS. I THINK OF IT LIKE POETRY, KIND OF LIKE A HAIKU, WHERE YOU SET A FEW WORDS AGAINST EACH OTHER, AND THEY CREATE A MOOD. THAT’S WHAT I THINK I’VE DONE. IT IS NOT AN INNATE THING; I DIDN’T INVENT ANYTHING. I JUST TOOK WHAT WAS OUT THERE IN THE WORLD AND REARRANGED IT TO CREATE MY OWN INTERPRETATION THAT MIGHT BE UNIQUE TO ME BUT WHICH IS FAMILIAR ENOUGH TO A LOT OF OTHER PEOPLE, SO THAT ULTIMATELY IT TURNS INTO A THING. I THINK I WAS LUCKY ENOUGH TO HAVE A KNACK FOR THAT, IN THE SAME WAY THAT SOME OF US ARE GOOD AT COOKING, SOME ARE GOOD AT SPORTS OR OTHER THINGS. \n\n\n\n YOU KNOW, NOBODY CAN REALLY EXPLAIN IT COMPLETELY BECAUSE OTHERWISE IT WOULD BE TOO EASY TO REPLICATE, AND THAT’S THE MAGIC. THERE IS MYSTERY TO HOW SOMETHING LIKE THIS STAYS UP IN THE AIR. THANK YOU FOR YOUR QUESTION; IT WAS FUN TO ANSWER. \n\n\n\n JESSIE ZHAO \n\n\n\n I FIRST BECAME AWARE OF RICK THROUGH MY HUSBAND AROUND FIVE YEARS AGO. I LOVE THE BRAND BECAUSE IT IS UNCOMPROMISING AND ENABLES ME TO FEEL MY MOST CONFIDENT. I HAVE HAD A JOURNEY OF LEARNING AND MAKING FRIENDS AND FAMILY WITH THE BRAND AND THE GREATER ART WORLD. \n\n\n\n HEY RICK, OUT OF YOUR ENTIRE CAREER, WHAT WAS THE MOMENT WHEN YOU FELT MOST PROUD OF YOURSELF? \n\n\n\n RICK OWENS: HEY, JESSIE. WOW! YOU LOOK AMAZING. THAT’S FROM THE LAST SHOW; MICHÈLE WORE A VERSION OF IT. WHEN WAS I THE PROUDEST? WELL, THERE HAVE BEEN A FEW MOMENTS. I THINK, I GOT A LITTLE BIT TEARY AT MY LAST MENSWEAR SHOW, WHEN I PLAYED THIS SISTERS OF MERCY SONG THAT I USED TO LISTEN TO OVER AND OVER AGAIN WHEN I WAS IN MY TWENTIES. WHEN I THINK OF THAT PERIOD, WHAT I CAN REMEMBER OF IT, I FELT LIKE I HAD POTENTIAL, BUT I WAS AFRAID OF NOT FULFILLING IT, SO THERE WAS FEAR AND FRUSTRATION, BECAUSE I FELT LIKE I MIGHT NOT MAKE IT. LISTENING TO THAT SONG OVER AND OVER AGAIN AT THE TIME, AND THEN BEING ABLE TO PLAY THAT SONG IN PARIS AT FULL BLAST, WITH REALLY GOOD LIGHTS AND REALLY GOOD MODELS, FOR A COLLECTION THAT I REALLY LIKED… I KIND OF LUXURIATED IN THE SATISFACTION OF HAVING TRAVELLED ALL THAT WAY AND HAVING FULFILLED THE POTENTIAL THAT I THOUGHT I HAD THEN. THAT WAS A VERY SATISFYING AND EMOTIONAL MOMENT. \n\n\n\n THE OTHER MOMENT THAT COMES TO MIND WAS WHEN I DID A RETROSPECTIVE AT THE TRIENNALE MUSEUM IN MILAN. THEY ALLOWED ME TO CURATE IT MYSELF, SO BEING ABLE TO KIND OF CELEBRATE WHAT I THOUGHT WERE MY SUCCESSES AND ELIMINATE ANY FLAWS OR THE MISTAKES THAT I THOUGHT I HAD MADE. I WAS ABLE TO PRESENT MYSELF AND INTERPRET MYSELF, WHICH FELT LIKE A UNIQUE POSITION. WELL, I GUESS INSTAGRAM IS TOTALLY LIKE THAT: YOU ARE PRESENTING THE PERSON YOU WANT TO BE, THE BEST ASPECTS AND THE MOST FLATTERING ANGLES, AND YOU ARE CREATING. I DON’T THINK ANYONE ELSE WOULD THINK OF INSTAGRAM THIS WAY, BUT WHAT I THOUGHT ABOUT WHEN I WAS DOING THAT TRIENNALE, THAT MUSEUM RETROSPECTIVE, WAS THAT IT WAS LIKE AN OBITUARY, NOT IN A GLOOMY WAY, BUT RATHER: I AM IN CONTROL OF MY NARRATIVE; I AM ABLE TO SUMMARISE WHO I AM, WHO I WAS, BOTH NOW AND FOR ANY RETROSPECTIVE I MIGHT HAVE IN THE FUTURE. IT FELT MONUMENTAL, SEEING IT COLLECTED ALL TOGETHER; I JUST KIND OF LUXURIATED IN THAT. IT WAS A PRETTY BIG MOMENT FOR ME. THANK YOU FOR THAT QUESTION. \n\n\n\n INA CLAVANO \n\n\n\n MY NAME IS INA, AND I FIRST BECAME AWARE OF RICK AROUND 10 YEARS AGO NOW. I’M BASED IN LAS VEGAS WITH MY HUSBAND FRANKLIN, AND WE USED TO SHARE RUNWAY LOOKS AND ‘FIT PICS’ OF PEOPLE WEARING AND STYLING RICK OWENS. AS PRE-CAREER KIDS WHO WERE BROKE WE ONLY DREAMED OF HAVING ENOUGH OF HIS PIECES TO FEEL THE MAGIC AND SELF-ASSURANCE HIS CLOTHING RADIATES WHEN WORN. THAT IS PART OF THE REASON WHY RICK OWENS IS SO IMPORTANT TO ME – THERE IS AN ESSENCE AND TRANSCENDENTAL NATURE IN HIS DESIGNS. IT’S NOT JUST WEARABLE ART BUT A WEARABLE EMOTION. IT FEELS LIKE ARMOUR FOR THE EVERYDAY WORLD, EVEN WITH THE SIMPLEST PIECES. DESPITE THE ENCHANTMENT THAT HIS CLOTHING ENCAPSULATES, IT IS STILL VERY HUMAN – BECAUSE OF HIM, BECAUSE HE IS NOT AFRAID TO ADMIT OR FORGET OR REMIND US ALL THAT HE IS JUST HUMAN. HE CREATES THE BALANCE THAT HE BELIEVES IN AND CONTRIBUTES IT TO THE WORLD. \n\n\n\n HEY RICK, YOU OFTEN TALK ABOUT THE ANGER OF YOUR YOUTH, AND HOW IT TRULY MANIFESTED IN YOUR ART AND CONTRIBUTIONS TO THE WORLD. DO YOU THINK THAT THE DEEP ANGER AND PAIN THAT A PERSON CAN’T ESCAPE CAN BE BEAUTIFUL, OR IF GIVEN THE CHANCE WOULD YOU BE RID OF YOURS COMPLETELY? THANKS FOR EVERYTHING. \n\n\n\n RICK OWENS: HI, INA, GOOD QUESTION. I GUESS I WOULDN’T; I WOULD LIKE TO MAKE SURE THOUGH THAT I DON’T OVERINDULGE, BECAUSE A LOT OF PEOPLE HAVE PAIN AND DISCOMFORT, AND MINE HASN’T BEEN THAT SPECIAL. I DO WONDER, HAD I BEEN COMPLETELY TRANQUIL AND SERENE AS A CHILD, WOULD THAT HAVE MADE ME NOT HAVE THE ENERGY TO REACT. WHEN I THINK BACK, I AM GRATEFUL FOR SITUATIONS THAT MADE ME WANT TO REACT. MAYBE I JUST ENJOY HOLDING RESENTMENT BECAUSE I AM A SCORPIO, AND WE ARE SUPPOSEDLY RESENTFUL. \n\n\n\n I THINK THAT TO BE CREATIVE YOU HAVE TO HAVE A CERTAIN SENSITIVITY TO THINGS, AND MAYBE I HAVE THAT AWARENESS. WE ALL HAVE OUR STRENGTHS. THERE IS NO RECIPE, BUT I ASSUME THAT WHAT I HAVE BEEN ABLE TO DO CREATIVELY HAS BEEN A RESPONSE TO THINGS THAT HAPPENED TO ME EARLIER. I DON’T WANT TO MAKE IT SOUND LIKE I WAS ABUSED OR ANYTHING, NOT AT ALL, BUT I WAS JUST REALLY SENSITIVE, AND I ENDED UP WHERE I SHOULDN’T HAVE BEEN. BUT IT ALL WORKED OUT, DIDN’T IT? OH, AND THAT KAFTAN THAT YOU’RE WEARING, I TRY AND PUT IT IN EVERY COLLECTION BECAUSE I THINK IT IS ONE OF OUR PIECES THAT KIND OF SAYS IT ALL. IT’S SEXY AND OPULENT, AND IT TAKES UP A LOT OF SPACE AROUND YOU. IT IS KIND OF FORMAL AND THIS WORLD CAN BE SO INFORMAL AND MESSY. YOU’RE ACTUALLY REMINDING ME THAT WE HAVE TO MAKE SURE WE HAVE THAT DRESS IN EVERY POSSIBLE FABRIC IN THE COLLECTION, SO THANK YOU FOR WEARING IT. \n\n\n\n KENNY RUFINO \n\n\n\n I PROBABLY FIRST HEARD ABOUT RICK OWENS AROUND 2003-2004 BUT REALLY BECAME A FAN A FEW YEARS LATER WHEN THE FIRST NEW YORK STORE OPENED ON HUDSON. THE RICK OWENS UNIVERSE CONNECTED WITH ME BECAUSE I FELT ATTRIBUTES OF THE BRAND THAT HAVE BEEN INSTRUMENTAL TO ME PERSONALLY, LIKE EXPRESSING YOUR INDIVIDUALITY, DEVELOPING A DISTINCT POINT OF VIEW, LIVING WITH YOUR CONTRADICTIONS. HOW RICK AND HIS WORK CONTINUE TO EVOLVE INTO NEW FORMS, INSPIRE DISCOURSE, AND REDEFINE OUR SOCIOCULTURAL MILIEU IS INSPIRING AND RARE. I DON’T KNOW WHERE HIS VISION WILL GO NEXT, BUT I KNOW I’LL BE THERE FOR THE RIDE. \n\n\n\n HI RICK, IF YOU HAD THE ABILITY TO GO BACK IN TIME AND ASK JUST ONE QUESTION TO ANY ONE PERSON IN HISTORY, WHO WOULD THAT PERSON BE AND WHAT WOULD YOU ASK? \n\n\n\n RICK OWENS: HI KENNY, I LIKE YOUR LOOK. I’M SURE I SHOULD COME UP WITH SOMEONE WAY MORE INTELLECTUAL AND ESOTERIC, BUT THE FIRST PERSON WHO COMES TO MIND, IS SALVADOR DALÍ, AND I WOULD ASK HIM TO DESIGN MY HOUSE. I AM FASCINATED WITH HOW HE NAVIGATED HIS LIFE. JUST HIS MIND-BENDING WAY OF THINKING, LIKE CREATING THAT SCULPTURE OF ALICE COOPER’S BRAIN OUT OF CROISSANTS AND ANTS. OH, AND WHEN HE SAID, ‘I DON’T DO DRUGS, I AM DRUGS.’ THERE IS A HELMUT NEWTON PICTURE OF SALVADOR DALÍ SHORTLY BEFORE HIS DEATH THAT I LOOK AT EVERY DAY; HE IS IN A WHEELCHAIR WEARING A SATIN GOWN WITH OXYGEN TUBES UP HIS NOSE. I LIKE HIS SENSE OF ABSURDITY AND NO LIMITS, AND ANYTHING CAN HAPPEN, AND DADAISM. I NEVER WANT TO FORGET THAT YOU CAN DO ANYTHING; YOU CAN SLIP AND SLIDE AND TURN INTO ANYTHING AND TURN INSIDE OUT. I JUST LIKE THE IDEA OF BEING ABLE TO LIVE IN AN ENVIRONMENT LED BY THAT KIND OF ATTITUDE. I HOPE THAT WAS A SATISFYING ENOUGH ANSWER TO YOUR QUESTION, KENNY. \n\n\n\n MATT CAMPO \n\n\n\n I HAD BEEN MILDLY FAMILIAR WITH RICK’S CLOTHES SINCE 2009, BUT COMING ACROSS THE MEN’S FALL/WINTER 2014 LOOKBOOK SHOT BY RICK CASTRO WHILE BROWSING SOME RANDOM FASHION WEBSITE WAS A REAL EYE OPENER. IT WAS THE FIRST TIME I’D TRULY FOUND A CONNECTION WITH THE BRAND ON A PERSONAL LEVEL. THE SHOOT WAS SUBVERSIVE AND BEAUTIFUL: STOIC, INTERGENERATIONAL MALE FORM, LEATHER-FETISH AESTHETICS, THE SEVERE CULT-LIKE CLOTHES. I WAS HOOKED AND IMMEDIATELY DIVED DOWN THE RABBIT HOLE INTO THE WORLD OF RICK OWENS. THE BRAND CONTAINS MULTITUDES; I FIND IT THE PERFECT VEHICLE FOR DISRUPTING THE EVERYDAY. EVERY PIECE POSSESSES A LEVEL OF CONSIDERATION THAT CARRIES THROUGH ANY OCCASION OR CIRCUMSTANCE: FROM PEAK COSY PANDEMIC WORK-FROM-HOME DAILY ISSUE TO OBSCENELY SCULPTURAL RUNWAY PIECES. RICK OWENS WORKS AS WELL FOR A GALA DINNER AS IT DOES WHEN JUST POPPING OUT TO GRAB GROCERIES. EITHER WAY, PEOPLE TAKE NOTICE. \n\n\n\n HEY RICK, OVER THE COURSE OF YOUR CAREER, YOU HAVE REINTRODUCED AND INTERPOLATED IDEAS AND THEMES FROM EARLIER COLLECTIONS, SOMETIMES MANY YEARS APART FROM THEIR DEBUT – IT’S ALMOST A WAGNERIAN SENSIBILITY OF LEITMOTIF. DO YOU HAVE A FAVOURITE IDEA, PATTERN OR CONCEPT THAT YOU HAVE BROUGHT BACK FROM AN EARLIER COLLECTION, AND DO YOU THINK IT WAS MORE SUCCESSFULLY EXECUTED THE SECOND TIME AROUND? THANKS! \n\n\n\n RICK OWENS: HEY MATT, I KNOW EXACTLY WHAT YOU’RE SAYING BUT I THINK I ONLY HAVE A CERTAIN NUMBER OF THINGS IN MY TOOLBOX, SO I AM GOING TO REPEAT MYSELF A LOT. I ADMIT THAT THERE HAVE BEEN TIMES IN THE PAST WHEN I DIDN’T HAVE FULL CONTROL OF ALL OF MY RESOURCES AND POWERS, SO I HADN’T LEARNED YET HOW TO EXECUTE THINGS IN A CERTAIN WAY. SO IT’S BEEN A PLEASURE TO GO BACK AND LOOK AT IT ANEW FROM A DIFFERENT ANGLE, AND REPEAT, MAYBE REPAIR, MAYBE ENHANCE OR JUST ENJOY REPEATING IN A DIFFERENT WAY. I THINK THERE IS A GOOD LESSON THERE – IF YOU HAD A GOOD IDEA ONCE, WHY SHOULD IT DISAPPEAR, WHY NOT REINTRODUCE IT AND WHY NOT CELEBRATE IT? GOOD IDEAS DON’T NECESSARILY NEED TO BE DISCARDED FOR THE NOVELTY OF SOMETHING NEW. IF SOMETHING IS GOOD, IT IS WORTH REPEATING. \n\n\n\n ONE OF MY BIGGEST LIFE LESSONS IS THAT YOU CAN GO BACK AND REPAIR THINGS, AND THIS APPLIES TO MISTAKES IN RELATIONSHIPS, TOO. I HAVE GONE BACK, AND I HAVE MADE AMENDS TO PEOPLE. THIS ISN’T LIKE A 12-STEP THING – I NEVER DID THAT – BUT YOU CAN THINK BACK ON SOMEONE THAT YOU FELT YOU DIDN’T TREAT AS WELL AS YOU WANTED TO AND DO SOMETHING ABOUT IT. GOOD QUESTION MATT, AND I’M GLAD YOU’RE WEARING THAT TOP, IT LOOKS GOOD ON AND I’M GLAD YOU’RE WEARING THAT TOP, IT LOOKS GOOD ON YOU. \n\n\n\n MICHAEL SMITH \n\n\n\n I FIRST BECAME AWARE OF RICK OWENS WHEN I WAS A SOPHOMORE IN COLLEGE AND STILL DRESSED VERY PREPPY. AT THE TIME I WASN’T A VERY BIG FAN, BUT IN A SHORT TIME I GREW OBSESSED. RICK IS OBVIOUSLY MY FAVOURITE CLOTHING BRAND, AND I FEEL VERY CONFIDENT AND COMFORTABLE IN HIS CLOTHES. THROUGH THE BRAND I HAVE ALSO MET SEVERAL OF MY FRIENDS IN NEW YORK, AND MANY OTHER PEOPLE WHO I HAVE A LOT IN COMMON WITH BESIDES CLOTHING TASTE. RICK’S DEFINING FEATURE HAS ALWAYS BEEN WORLD BUILDING, HOW HE CREATES A LOOK SO SPECIFIC AND SO RECOGNISABLE THAT IT BECOMES DIFFICULT TO OWN ANYTHING BESIDES RICK. EVERYTHING HE MAKES FITS SEAMLESSLY INTO HIS ARCHIVE OF WORK, AND IT IS POSSIBLE TO CREATE MANY DIFFERENT STYLES USING JUST RICK. \n\n\n\n HELLO, RICK. I’M WONDERING IF THERE’S ANYTHING YOU’VE WANTED TO DO WITH YOUR BRAND THAT YOU HAVEN’T BEEN ABLE TO ACCOMPLISH YET – LIKE AN OBJECT YOU’VE WANTED TO MAKE OR A RUNWAY CONCEPT YOU’VE WANTED TO DO – AND IF SO, WHAT THAT MIGHT BE? \n\n\n\n RICK OWENS: HI, MICHAEL, THE FIRST THING THAT COMES TO MIND IS ONE TIME WHEN WE WANTED TO DO A RUNWAY SHOW AND SET THE MODELS ON FIRE. I WAS SURE THAT WE COULD DO IT, AND I PUSHED AND PUSHED AND PUSHED. I KNOW THAT INSIDE THE PALAIS DE TOKYO IN THE 1950S, THEY HAD DONE AN INSTALLATION WITH FIRE, BUT FOR SOME REASON WITH CONTEMPORARY LEGALITIES AND SAFETY REGULATIONS, IT JUST WASN’T THE TIME TO SET PEOPLE ON FIRE IN THE GALLERY ITSELF. THEN KANYE DID IT IN A STADIUM SHOW IN THE MIDWEST OR SOMEWHERE; I MEAN A HUGE ARENA, GRANTED. BUT, YEAH, MODELS ON FIRE, I AM DISAPPOINTED I DIDN’T GET TO DO THAT. \n\n\n\n AS FAR AS COLLECTIONS GO, I SUPPOSE THERE HAVE BEEN INDUSTRIAL AND TECHNICAL BLOCKS IN THE PAST, BUT PART OF THE FUN OF WHAT I DO IS TAKING A SET AMOUNT OF RESOURCES AND LEARNING, AND COMING UP WITH A SATISFYING SOLUTION WITHIN A LIMITED AMOUNT OF TIME. THAT’S THE PUZZLE AND THE CHALLENGE, AND THERE IS RESTRAINT IN THAT; A CERTAIN AMOUNT OF MODESTY, THRIFTINESS AND RESOURCEFULNESS THAT YOU HAVE TO APPLY. \n\n\n\n PEOPLE SOMETIMES ASK ME IF I EVER WANT TO EXPLORE MORE ARCHITECTURALLY, BUT I AM KIND OF SATISFIED WITH TRANSFORMING THE ENVIRONMENTS THAT I’M IN. I UNDERSTAND THE AMBITION OF ARCHITECTURE, BUT I DON’T KNOW IF I COULD HANDLE THE LACK OF SPEED BECAUSE I AM SO USED TO THE RUNWAY CYCLE. I’VE PROBABLY BECOME ADDICTED TO IT. I TRY NOT TO BE TOO GREEDY, AND I AM TRYING TO DO THINGS WITHIN INTEGRITY. SO, YEAH, I THINK MORE ABOUT EVERYTHING I HAVE GOTTEN MORE THAN WHAT I HAVE MISSED OUT ON, AND I HAVE GOTTEN MORE THAN I EVER EXPECTED OR IMAGINED – I AM NOT COMPLAINING. THANK YOU, MICHAEL. \n\n\n\n OLIVER SUCHANEK \n\n\n\n I’M 27, LIVE IN LONDON, AND I’M AN AIRCRAFT ENGINEER. I WAS A BIT OF A SKATER KID GROWING UP, WITH THE GOTHS AND THE SCENE KIDS, SO MY FASHION BACKGROUND IS RIPPED SKINNY DENIM, TRASHED TEES, VANS AND HOODIES. I THINK THE FIRST TIME I BECAME AWARE OF RICK WAS WHEN I WAS AROUND 18 OR 19, WHEN FOR SOME REASON I TUNED INTO THE AUTUMN/WINTER 2013 PLINTH SHOW. IT WAS A EUREKA MOMENT FOR ME WHEN I REALISED THAT CLOTHES AREN’T JUST CLOTHES; THEY COULD BE GRITTY AND DIRTY AND ALL THE THINGS I WAS WEARING AS A KID, BUT JUST DONE DIFFERENTLY. RICK IS AN INSPIRATION AND I’VE STUCK WITH THE BRAND ESSENTIALLY FOR THE 10 YEARS I’VE BEEN INTO FASHION. I’VE DEVELOPED MY TASTES AND MY IMAGE ALONGSIDE RICK AS HE HAS DEVELOPED THROUGH THE ERAS OF HIS COLLECTIONS. IT’S INSPIRED AND PUSHED ME INTO WEARING THINGS THAT I NEVER THOUGHT I COULD POSSIBLY PULL OFF. A BIG PART OF THE LABEL’S UNIQUENESS IS THE CONSTANT DEVELOPMENT AND MORPHING OF ITSELF; YOU CAN SEE PREVIOUS COLLECTIONS IN CURRENT COLLECTIONS, BUT IN A WAY THAT ISN’T DERIVATIVE, STALE OR BORING. \n\n\n\n HI RICK, I TEND TO JUMP BETWEEN CREATIVE PROJECTS TOO QUICKLY AND I DON’T DEDICATE ENOUGH TIME TO EACH ONE. AS SOMEONE WHO HAS A LOT OF CREATIVE PROJECTS GOING, HOW DO YOU ENSURE THAT YOU DEDICATE ENOUGH TIME TO EACH ONE WITHOUT RUSHING? \n\n\n\n RICK OWENS: HI OLIVER, I DON’T KNOW IF I’M QUALIFIED TO ANSWER THAT QUESTION BECAUSE I DON’T KNOW IF I’VE MASTERED IT. I AM CONSCIOUS THAT YOU HAVE TO HAVE A CERTAIN KIND OF MOMENTUM TO GET TO A CERTAIN LEVEL AND WHEN YOU DO THAT THERE ARE THINGS THAT SLIP THROUGH THE CRACKS. I DO WONDER IF I AM GOING TO LOOK BACK AND REGRET HOW MANY THINGS I LET SLIP THROUGH; IT IS FRUSTRATING THAT YOU CAN’T HAVE YOUR FINGER ON EVERY SINGLE THING, BUT THERE HAS TO BE AN ELEMENT OF TRUST. I TRUSTED TOO MUCH AT SOME POINTS IN MY CAREER AND THINGS FELL APART, OR I DIDN’T TRUST AT ALL AND HELD THE REIGNS TOO TIGHTLY AND WAS TOO UPTIGHT, AND THAT DIDN’T WORK EITHER. THEN THERE ARE THE TIMES WHEN I FOUND THE RIGHT BALANCE, WHERE I TRUSTED ENOUGH AND ALLOWED PEOPLE TO PARTICIPATE IN A COMFORTABLE WAY, AND I GOT THE RESULTS THAT I WANTED. IT IS A KIND OF A CONSTANT BALANCE YOU HAVE TO TRY AND MAINTAIN, AND IT IS REALLY TRICKY. BECAUSE YOU HAVE TO WORK WITH A LOT OF PEOPLE WHO ARE PUTTING THEIR OWN PERSONAL EMOTIONAL INVESTMENTS INTO SOMETHING WITH YOU, AND YOU HAVE TO RESPECT THAT. BEING ABLE TO RESPECT IT AND DIRECT IT AND COLLABORATE WITH THAT KIND OF EMOTIONAL FORCE, THAT IS A FRAGILE AND DELICATE THING. AND IT’S NOT LIKE I AM A MASTER OF IT. BUT GOOD LUCK WITH THAT. IF YOU ARE CONSCIOUS OF IT OLIVER, THEN YOU ARE ALREADY LOOKING FOR AN ANSWER, AND THAT’S A POSITIVE THING. \n\n\n\n WILLIAM BRAGGADOCIO \n\n\n\n IN A PAST CAREER, I WAS A BUYER FOR A CHICAGO BOUTIQUE CALLED GALLERY AESTHETE. I WAS LUCKY ENOUGH TO TRAVEL TO THE RICK OWENS SHOWROOMS AND RUNWAY SHOWS. I NOW WORK IN TV AND FILM PRODUCTION AS AN ASSISTANT COSTUME DESIGNER, BUT I STILL MAKE A POINT OF KEEPING UP WITH THE RICK OWENS BRAND. I DISCOVERED RICK OWENS BACK IN HIGH SCHOOL WHEN I WAS VIEWING SOME COLLECTIONS (EMBARRASSINGLY, I RECALL IT WAS DOLCE AND GABBANA). IT WAS HIS CRUST COLLECTION [AUTUMN/WINTER 2009]. AT THAT MOMENT, SOMETHING FLIPPED ON IN ME. IT FELT LIKE I HAD BEEN LOOKING FOR THIS, AND IT FELL INTO MY LAP. EVER SINCE, I HAVE BEEN DEEPLY ENAMOURED WITH HIS BRAND. PERSONALLY, RICK OWENS IS ESSENTIAL TO MY EVERYDAY. EVERY PIECE I COLLECT FEELS LIKE ADDING ART TO MY LIFE. IT MAKES MY WORLD FEEL A LITTLE MORE BEAUTIFUL AND SPECIAL. \n\n\n\n HELLO, MR OWENS, WHAT WOULD YOU SAY IS A TRANSCENDENT MOMENT IN YOUR CAREER AS A DESIGNER? \n\n\n\n RICK OWENS: HI, WILLIAM. I HAVE HAD MORE TRANSCENDENT MOMENTS THAN I EVER REALLY HAD THE IMAGINATION TO THINK OF. AS A DESIGNER, PEOPLE SOMETIMES ASK ME ABOUT THE HIGH OF THE RUNWAY SHOW, AND THERE IS A HIGH, BUT TO ME THE RUNWAY-SHOW EXPERIENCE IS ALWAYS ONE OF GREAT PEACE. I FEEL A SENSE OF SATISFACTION, LIKE IT’S A GOOD SOLUTION TO A PUZZLE; LIKE I HAVE BEEN ABLE TO COME UP WITH A DECENT CONVINCING PLAUSIBLE STORY, USING THE LIMITED RESOURCES AND TIME THAT I HAD. YOU WORK HARD TO MAKE SURE IT HAPPENS. IT IS NOT LIKE I LEAVE A LOT OF ELEMENTS TO CHANCE, I AM THE ONE THERE GUIDING IT ALONG AND MAKING SURE IT COMES OUT THE WAY I WANT IT TO. I AM NOT SAYING THAT IN A GLOATING WAY BECAUSE IT TAKES A LOT OF EFFORT TO MAKE THAT HAPPEN AND I PUT THAT EFFORT IN. IT IS NOT EXACTLY TRANSCENDENT, BUT IT IS DEEPLY SATISFYING BECAUSE EVERYTHING FALLS INTO PLACE, AND YOU GET TO SEE THE FINAL RESULTS. THAT LITTLE EMOTIONAL TRANSCENDENT MOMENT COMES WHEN I FEEL LIKE, ‘OH I HAVE GOT ENOUGH ELEMENTS IN THIS STORY FOR IT NOW TO TRULY WORK.’ I THINK THAT MIGHT BE TRANSCENDENT AND THAT USUALLY HAPPENS A WEEK BEFORE I HAVE TO LAUNCH THE COLLECTION, USUALLY ON A SATURDAY NIGHT, LATE AT NIGHT, IN AN EMPTY FACTORY IN THE MIDDLE OF NOWHERE IN ITALY, WHEN I AM BY MYSELF. \n\n\n\n BESIDES THAT, THERE HAVE BEEN TIMES I REMEMBER BEING HIGH ON A DANCE FLOOR, AND FEELING LIKE THAT’S THE MOST TRANSCENDENT THING I COULD THINK OF ON A SATURDAY NIGHT, BUT BEING ALONE IN A FACTORY AND HAVING EVERYTHING FALL INTO PLACE – THAT MIGHT BE TRANSCENDENCE FOR ME NOW. THANKS AGAIN FOR YOUR QUESTION, WILLIAM.",
        "link": "https://www.rickowens.eu/en/MX/interviews/system-issue-19"
    }
]